[
    {
        "subject": " .NET Application Development ",
        "link": "https://handbook.uts.edu.au/subjects/32998.html",
        "description": "This subject introduces C#, Visual Studio and the .NET development environment. The emphasis is on examining the .NET framework and the practicalities of developing software in this setting using the C# language."
    },
    {
        "subject": " 3D Animation ",
        "link": "https://handbook.uts.edu.au/subjects/32543.html",
        "description": "This subject covers the major areas of 3D computer animation. It provides students with the opportunity to learn a major commercial 3D modelling, animation and rendering package. It also covers the principles and practice of pre-production planning, production management, and post-production of an animation project. The subject is project-based, and each student develops an animation of their choice."
    },
    {
        "subject": "3D Computer Animation ",
        "link": "https://handbook.uts.edu.au/subjects/31241.html",
        "description": "This subject explores storytelling using 3D computer animation. It covers the complete animation production pipeline which includes ideation, storyboarding, 3D animation, lighting, rendering, and VFX. Students also have the opportunity to practice the pre-production planning, production management and post-production of an animation project. The subject is project-based and students learn by doing."
    },
    {
        "subject": " Adaptive Leadership Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42709.html",
        "description": null
    },
    {
        "subject": "Advanced Algorithms ",
        "link": "https://handbook.uts.edu.au/subjects/41052.html",
        "description": "Algorithms are the heart of computer science and information technology. This subject moves beyond the basic material that introduces algorithms and data structures and looks at some of the more complicated algorithms, how to implement them and what they can be used for. Alongside this the subject delves into practical concerns of methods for dealing with apparently intractable computational problems, tools for selecting and evaluating algorithms and communicating effectively algorithmic strategies. "
    },
    {
        "subject": "Advanced Data Analytics ",
        "link": "https://handbook.uts.edu.au/subjects/42822.html",
        "description": "Data analytics is the art and science of turning large quantities of usually incomprehensible data into meaningful and commercially valuable information. It is the basis of modern computer analytics and intelligence. It includes a number of IT areas, such as statistical methods for identifying patterns in data and making inferences; database technologies for managing the data sets to be mined; a range of intelligent technologies that derive automatically patterns from data; and visualisation and other multimedia techniques that support human pattern discovery capabilities.  Advanced Data Analytics develops skills in data classification and prediction by practical activities in decision tree induction, classification by support vector machine, ensemble methods and random forest, classification accuracy and identifying issues in prediction. Building from Data Analytics Foundations, the microcredential enables an exploratory data visualisation and evaluation of results. "
    },
    {
        "subject": "Advanced Data Analytics Algorithms ",
        "link": "https://handbook.uts.edu.au/subjects/32513.html",
        "description": "Advanced data analytics address the problem of learning from data, which is an exciting field studying how intelligent agents can learn from and adapt to experience and how to realise such capacity on digital computers. It is applied in many fields of business, industry and science to discover new information and knowledge. This subject takes a machine learning-orientated approach. At the heart of machine learning are the knowledge discovery algorithms. This subject builds on previous data analytics subjects to give an understanding of how both basic and more powerful algorithms work. It consists of both hands-on practice and fundamental theories. Students learn important techniques in the field by implementation and theoretical analysis. The subject also introduces practical applications of machine learning, especially in the field of artificial intelligence."
    },
    {
        "subject": "Advanced Database ",
        "link": "https://handbook.uts.edu.au/subjects/32113.html",
        "description": "This subject reviews material on relational databases and covers advanced topics such as distributed databases. Data warehousing and mining techniques, implementation and management are covered in detail."
    },
    {
        "subject": "Advanced Games Programming ",
        "link": "https://handbook.uts.edu.au/subjects/41024.html",
        "description": "This subject explores advanced topics in games development, including artificial intelligence, procedural content generation, and networked multiplayer. These topics are taught through the Unreal Engine, requiring students to work extensively with C++, which students are expected to have prior experience with. The concepts and algorithms that students learn here are generlizable and can be applied across various game development environments. This subject encourages students to further develop their understanding of these topics and bring them together in a session-long group project, resulting in the creation of a novel and technically advanced game or tool prototype. This prototype benefits student portfolios for future employment opportunities and enables students in the Bachelor of Science in Games Development to make strong contributions in the third-year capstone group projects. The creation of the subject material was supported by the 2019 Epic MegaGrants scheme provided by the developers of the Unreal Engine."
    },
    {
        "subject": "Advanced Interaction Design ",
        "link": "https://handbook.uts.edu.au/subjects/32509.html",
        "description": "This subject focuses on the concept of user experience (UX) in Interaction design. UX is defined as a person's perceptions and responses that result from the use of a digital product, system or service. Understanding how to approach UX in design is a major focus in interaction design because the quality of UX can affect people's adoption of a particular designed technology. For many technology design companies, paying attention to how people experience their products is the edge that can potentially set them apart from their competition. However, designing UX effectively is difficult because the term UX is very problematic, meaning very different things to different people, in academic research and in industry.  Firstly, students are provided with some conceptual tools to help them talk about UX productively: to identify, describe, analyse and critique real-life experiences with various types of digital technologies. To put these skills into practice, students are introduced to a range of current and emergent human-computer interactions such as mobile and social computing, pervasive and ubiquitous computing, quantified self, and the 'internet of things' (IoT). Through discussing and exploring particular characteristics, interaction styles, affordances, and the ways these technologies are used in our everyday lives, students develop the skills to be able to understand the types of user experiences that arise from people's interactions with particular technologies, while pursuing specific goals, whether alone or with others, carried out in particular contexts. Through this, they understand how to consider relevant and appropriate user experiences to support when designing for different kinds of human-computer interactions. Students also learn methods, concepts, and techniques used in design activities to support for a specific user experience. This includes user research techniques, sketching, storyboarding, prototyping and evaluation approaches that can support them to design appropriate and engaging user experiences. They hone their skills through responding to a real-world problem, designing a technology solution that not only meets the users' needs effectively but, more importantly, supports desirable and potentially engaging experiences. By building upon students' prior understandings of fundamental interaction design concepts and processes, it is expected that when they successfully complete this subject, they are able to not only design useful and usable technologies, but also technologies that are optimised to support the users' experience."
    },
    {
        "subject": "Advanced Interaction Design ",
        "link": "https://handbook.uts.edu.au/subjects/31777.html",
        "description": "This subject focuses on the concept of user experience (UX) in Interaction design. UX is defined as a person's perceptions and responses that result from the use of a digital product, system or service. Understanding how to approach UX in design is a major focus in interaction design because the quality of UX can affect people's adoption of a particular designed technology. For many technology design companies, paying attention to how people experience their products is the edge that can potentially set them apart from their competition. However, designing UX effectively is difficult because the term UX is very problematic, meaning very different things to different people, in academic research and in industry.  Firstly, students are provided with some conceptual tools to help them talk about UX productively: to identify, describe, analyse and critique real-life experiences with various types of digital technologies. To put these skills into practice, students are introduced to a range of current and emergent human-computer interactions such as mobile and social computing, pervasive and ubiquitous computing, quantified self, and the 'internet of things' (IoT). Through discussing and exploring particular characteristics, interaction styles, affordances, and the ways these technologies are used in our everyday lives, students develop the skills to be able to understand the types of user experiences that arise from people's interactions with particular technologies, while pursuing specific goals, whether alone or with others, carried out in particular contexts. Through this, they understand how to consider relevant and appropriate user experiences to support when designing for different kinds of human-computer interactions. Students also learn methods, concepts, and techniques used in design activities to support for a specific user experience. This includes user research techniques, sketching, storyboarding, prototyping and evaluation approaches that can support them to design appropriate and engaging user experiences. They hone their skills through responding to a real-world problem, designing a technology solution that not only meets the users' needs effectively but, more importantly, supports desirable and potentially engaging experiences. By building upon students' prior understandings of fundamental interaction design concepts and processes, it is expected that when they successfully complete this subject, they are able to not only design useful and usable technologies, but also technologies that are optimised to support the users' experience."
    },
    {
        "subject": "Advanced Internet Programming ",
        "link": "https://handbook.uts.edu.au/subjects/31242.html",
        "description": "In this subject students create sophisticated web applications for deployment to production. The subject provides knowledge and skills in advanced internet technologies particularly related to server-side internet programming and business-to-business systems. It covers topics relevant to advanced internet programming including web development stacks, n-tier architectures, standards, transactions, security, dependency injection, layering, web-service integration, and deployment. The subject is run as a simulation of a technology-based startup or an in-house software development project. Students create a prototype for a simple idea. Throughout the session, students iteratively improve their prototype and apply the subject content to ensure that their prototype is secure, reliable, maintainable, well-designed and can handle real-world customers. Hands-on laboratory exercises and group activities give students practice in internet programming and develop their ability to problem-solve, collaborate and develop communication skills. Outside class, students are required to engage in self-directed learning and with their professional community."
    },
    {
        "subject": "Advanced Internet Programming ",
        "link": "https://handbook.uts.edu.au/subjects/32549.html",
        "description": "In this subject students create sophisticated web applications for deployment to production. The subject provides knowledge and skills in advanced internet technologies particularly related to server-side internet programming and business-to-business systems. It covers topics relevant to advanced internet programming including web development stacks, n-tier architectures, standards, transactions, security, dependency injection, layering, web-service integration, and deployment. The subject is run as a simulation of a technology-based startup or an in-house software development project. Students create a prototype for a simple idea. Throughout the session, students iteratively improve their prototype and apply the subject content to ensure that their prototype is secure, reliable, maintainable, well-designed and can handle real-world customers. Hands-on laboratory exercises and group activities give students practice in internet programming and develop their ability to problem-solve, collaborate and develop communication skills. Outside class, students are required to engage in self-directed learning and with their professional community."
    },
    {
        "subject": "Advanced Project Management ",
        "link": "https://handbook.uts.edu.au/subjects/32601.html",
        "description": "This subject covers advanced content for project professional practice with emphasis on contemporary issues in the delivery of complex solutions to business. It considers human and organisational aspects of project management, the importance of project governance, the changing nature of project management and the role of the project manager in the global business environment."
    },
    {
        "subject": "Advanced Routing Principles ",
        "link": "https://handbook.uts.edu.au/subjects/32009.html",
        "description": "This subject focuses on routing technology and provides students with a comprehensive explanation of routing. It extends students' skills and knowledge in route optimisation and redistribution, router and routing protocol hardening, scalable interior and exterior routing protocols. The related topics are widely related to CCNA Routing and Switching: Connecting Networks and Scaling Networks and CCNP Route. The subject is run in the UTS Cisco Systems Network Academy."
    },
    {
        "subject": "Advanced Software Development ",
        "link": "https://handbook.uts.edu.au/subjects/41026.html",
        "description": "This subject discusses the advanced software development principles, methods, tools and techniques. In this subject students learn how to design, develop and evaluate a commercially realistic software system meeting predefined functional and non-functional requirements. The project is performed by highly autonomous teams that, while supervised and directed, are ultimately responsible for the project and delivery of the expected outcomes. The students experience, understand the importance of, and can apply sound practices of software development from team formation and management, project planning and management; and all the primary processes of software design, construction, evaluation and delivery. The students must also make informed design decisions, describe how those decisions were reached and justify those decisions."
    },
    {
        "subject": "AI/Analytics Capstone Project ",
        "link": "https://handbook.uts.edu.au/subjects/41004.html",
        "description": "This subject brings together the full skill set learned by students in data analytics. Students undertake a data analytics project as part of a team, manage the investigation, document their progress, communicate their findings and reflect on their learning. Projects are set out to solve real-world problems in academic research or industry and may include:  data generation/collection data processing/cleaning data modelling/analysis interpretation and communication of results.  Throughout the project, students are supported by an academic mentor and assessment through written reports and an oral presentation is in line with expectations from academic/industry."
    },
    {
        "subject": "AI/Analytics Capstone Project B ",
        "link": "https://handbook.uts.edu.au/subjects/31243.html",
        "description": "Data mining and knowledge discovery is the kernel of contemporary computer analytics and intelligence. The process consists of several iterative steps, including data pre-processing and transformation, the actual data mining and pattern discovery steps, and putting discovered information and knowledge into action. This subject is focused on the practical implementation of this process to large data sets from different areas of human endeavour. It provides students with exposure to real-world analytics scenarios, and with expertise and experience in the application of the data mining techniques and in professional communication of analytics results. Students choose a real-world project of interest and, with the help of a staff mentor, research, plan and produce an outcome. They communicate the results of the project in a detailed report."
    },
    {
        "subject": "Analytics in Human-centred Complex Systems ",
        "link": "https://handbook.uts.edu.au/subjects/41187.html",
        "description": "This studio-based subject introduces students to different applications of analytics in various human-centred socio technical systems as well as different ways of organisational value-creation through analytics. The main emphasis is on individual, organisational and societal consequences of advanced analytics, including algorithmic decision-making and AI. Students acquire the necessary skills and the mindset to analyse different types of analytics applications in a given context, in order to determine ethical and moral consequences for individual stakeholders, organisations and society. The topics cover societal consequences of datafication, algorithmic justice, data humanism and various frameworks for ethical decision-making. The subject leverages T&L resources made available on Teradata University Network (the largest international community of Business Intelligence and Analytics educators and industry leaders."
    },
    {
        "subject": "Application Development in the iOS Environment ",
        "link": "https://handbook.uts.edu.au/subjects/41889.html",
        "description": "This subject is an introduction to iOS application development. Students learn the Swift programming language, the iOS development environment and explore the iOS app frameworks. The subject has an emphasis on giving students practical exposure to software development in the iOS environment."
    },
    {
        "subject": "Application Development with .NET ",
        "link": "https://handbook.uts.edu.au/subjects/31927.html",
        "description": "This subject introduces C#, Visual Studio and the .NET development environment. The emphasis is on examining the .NET framework and the practicalities of developing software in this setting using the C# language."
    },
    {
        "subject": "Applied Data Analytics ",
        "link": "https://handbook.uts.edu.au/subjects/42823.html",
        "description": " Data analytics is the art and science of turning large quantities of usually incomprehensible data into meaningful and commercially valuable information. It is the basis of modern computer analytics and intelligence. It includes a number of IT areas, such as statistical methods for identifying patterns in data and making inferences; database technologies for managing the data sets to be mined; a range of intelligent technologies that derive automatically patterns from data; and visualisation and other multimedia techniques that support human pattern discovery capabilities.  Applied Data Analytics develops the autonomy of learners to plan and implement a data mining project using the most common approach to data mining called cross-industry standard process for data mining, known as CRISP-DM. From pre-processing to deployment of results: representing patterns as rules, functions, cases; model deployment; industry applications, this practical problem based microcredential enables demonstration of analytics expertise and professional communication of analytics."
    },
    {
        "subject": "Applied Machine Learning ",
        "link": "https://handbook.uts.edu.au/subjects/42892.html",
        "description": null
    },
    {
        "subject": "Applying Network Security ",
        "link": "https://handbook.uts.edu.au/subjects/41890.html",
        "description": "In the network security subject students learn about the theory underlying computer-security. This subject applies this theory to practice by using material based on the Cisco Network Security course. The emphasis is on network security appliances and networking infrastructure such as firewalls, access control, secure network design and Virtual Private Networks. Students work collaboratively throughout the session. From week 2 students form groups of three and all lab work is a shared experience. All additional activities, such as researching concepts, exploring networking challenges and building the required networks, are achieved by students working cooperatively. Groups are also encouraged to share their findings with other groups, and while most assessments are individual, this shared knowledge contributes positively to the whole learning experience."
    },
    {
        "subject": "Architecting on Amazon Web Services ",
        "link": "https://handbook.uts.edu.au/subjects/42049.html",
        "description": "Enterprises across the globe and of all sizes have either moved or are moving their workloads to the Cloud. AWS is the top cloud infrastructure provider in the world. As such, persons with AWS skills and knowledge are in high demand globally. The Faculty of Engineering and Information Technology (FEIT) has been selected by Amazon Web Services (AWS) to participate in the AWS Academy. As a part of this academy, FEIT will offer a subject focused on developing and deploying practical enterprise grade applications in the Cloud. In this course students will be exposed to and learn about engineering, building and deploying applications on the AWS Cloud. On completion of this short program students would have gained enough knowledge and skills to be an AWS certified Solutions Architect (Associate). The subject is based on the content of the authorized AWS Academy curriculum. "
    },
    {
        "subject": "Asset Creation ",
        "link": "https://handbook.uts.edu.au/subjects/42916.html",
        "description": null
    },
    {
        "subject": " Business Intelligence ",
        "link": "https://handbook.uts.edu.au/subjects/41191.html",
        "description": "This subject deals with information systems as part of business and other organisations. It addresses the processes of generation, dissemination, retention, application and distribution of corporate information and knowledge. The subject also includes key aspects of information systems development approaches and ways of designing systems that provide business intelligence to enterprises. The subject covers a range of issues in organisational applications of business intelligence with regard to knowledge management, enterprise/business process management and organisational decision making. The techniques are explored practically in project-based assignments."
    },
    {
        "subject": "Business Intelligence ",
        "link": "https://handbook.uts.edu.au/subjects/32558.html",
        "description": "This subject deals with information systems as part of business organisations. It addresses the processes of generation, dissemination, retention, application, and distribution of corporate information and knowledge. The subject also includes key aspects of information systems development approaches and ways of designing systems that provide business intelligence to enterprises. A range of issues in business organisations with regard to knowledge management is covered. The techniques are explored practically in project-based assignments."
    },
    {
        "subject": "Business Intelligence for Decision Support ",
        "link": "https://handbook.uts.edu.au/subjects/32567.html",
        "description": "Business intelligence is an umbrella term that combines architectures, tools, databases, analytical tools, applications and methodologies. The major objectives of business intelligence is to enable interactive access to data and to give business managers the ability to conduct analysis and make better decisions. \r\nDecision support systems are computer-based information systems that combine models/methods and data in an attempt to solve semi/non-structured decision problems with extensive user involvement through a friendly user interface. Business high-level decisions are often semi/non-structured and require an increased level of intelligent and technical support, in particular, when they become rich in data. Decision support systems can be integrated with variable business intelligence techniques to support related decision problem solving.\r\nThis subject introduces business intelligence, decision support systems, group decision support, intelligent decision support, web-based support systems, decision optimisation technologies, personalised recommender systems. The subject also covers how to design, implement and integrate business intelligence techniques with methods to support business decision-making."
    },
    {
        "subject": "Business Process and IT Strategy ",
        "link": "https://handbook.uts.edu.au/subjects/31245.html",
        "description": "This subject introduces students to the uses of information technology (IT) as a strategic resource that enables business processes and strategies. A major concern of businesses is the search for competitive advantage and how to best leverage IT resources and align them with business goals to achieve competitive advantage. For IT managers, this raises a number of complex issues to understand and manage. These issues relate to the roles of IT and IT strategy in enabling business processes and generating business benefits. In this subject, theories and methods related to the value of IT are presented and explored. Students learn and discuss business and strategy processes that lead to learning organisations that can achieve sustainable competitive advantage. Business processes and IT strategy are key concerns for business and IT managers. Managing information is a critical skill for success in today's business environment. Managers need to know about their organisation's capabilities and uses of information resources. This subject aims to provide a foundation to help general business managers become knowledgeable participants in decision-making processes related to information systems (IS). Critically reviewing the contributions of IS resources in businesses and organisational settings establishes a contextual understanding of how IS permeates many aspects of business. Through case studies this subject reinforces material provided in lectures and tutorials, additional research, and prior knowledge while giving groups of students scope to enhance their problem-solving, critical thinking and organisational skills as well as peer learning. The subject stresses the development and assessment of real-world experience through applied and innovative tasks and with team effort. Students develop the knowledge and skills required for using and managing information within an organisation as well as management and communication skills."
    },
    {
        "subject": "Business Process Management for Digital Transformation ",
        "link": "https://handbook.uts.edu.au/subjects/42086.html",
        "description": "In this subject students will acquire core competencies in Business Process Management (BPM) and will learn how to leverage them in digital transformation projects in diverse contexts (business, non-profit, government). Students will learn how to identify and prioritise relevant processes to be modelled, design a process architecture and apply standard modelling languages such as BPMN. They will develop and evaluate relevant representations of complex business processes in a consistent and unambiguous way. Students will also learn about the ethics of BPM and different ways of communicating BP models to diverse stakeholders. "
    },
    {
        "subject": "Business Requirements Modelling ",
        "link": "https://handbook.uts.edu.au/subjects/31269.html",
        "description": "This subject introduces information system concepts and describes how these concepts can be used to model business requirements. It outlines how the ability to capture information about the system in ways understood by its eventual users improves the final quality of the system. An overview of agile and non-agile software engineering principles, methods, tools and techniques is presented and practised in small teams. The subject introduces various analysis approaches found in contemporary system development including object-oriented methods, agile methods, business process modelling and entity-relationship modelling. It explores the relationships between these techniques and their application, and how they are used to capture and model the business requirements. Students apply various requirements elicitation, analysis, modelling and specification techniques to case studies in small teams."
    },
    {
        "subject": "Business Systems Design ",
        "link": "https://handbook.uts.edu.au/subjects/32559.html",
        "description": "This subject describes the tools, processes and practices used to design information systems in today's complex business environments that are characterised by a large variety of stakeholders with continually emerging needs. The challenge is to develop systems that enable stakeholders to collaboratively develop creative solutions to address such needs. Students work in teams to use tools that encourage the creativity needed to provide innovative solutions and learn how to combine these tools into development processes. The emphasis is on tools now used in design thinking and ways they are used in development, such as the double diamond method or the Stanford Hasso-Plattner processes. Examples of tools include persona maps, journey maps and the development of themes that can be used to formulate joint value propositions that satisfy stakeholders from a number of perspectives especially business activity, process workflow, social networking and knowledge sharing, and user-design perspectives. The subject then describes choosing appropriate emerging technologies to realise the solutions."
    },
    {
        "subject": " Capstone Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42704.html",
        "description": null
    },
    {
        "subject": "Career Management for IT Professionals ",
        "link": "https://handbook.uts.edu.au/subjects/31016.html",
        "description": "This subject aims to prepare IT students for their first IT role or internship, to effectively market themselves to employers and apply professional skills and behaviours sought in the workplace. The subject initially focuses on the skills required to be competitive job seekers, an understanding of how to develop effective targeted job applications, and how to perform well in an interview. It then prepares students for professional practice through discussion of topics such as Australian workplace culture, time and resource management, and health and wellbeing in the workplace."
    },
    {
        "subject": "Cloud Computing and Software as a Service ",
        "link": "https://handbook.uts.edu.au/subjects/42904.html",
        "description": "This subject introduces students to cloud computing fundamentals. Following a brief introduction to cloud computing, the following topics are covered: cloud architecture, infrastructure-as-a-service, platform-as-a-service, software-as-a-service, virtualisation and multi-tenancy. For the first assignment, students are expected to work in a group and develop a research report that critically analyses an aspect of cloud computing. Subsequently, students are exposed to cloud-based software engineering skills using an existing cloud platform. For the second assignment, students are expected to work in a group and develop a cloud-based software application."
    },
    {
        "subject": "Cloud Computing and Software as a Service ",
        "link": "https://handbook.uts.edu.au/subjects/41001.html",
        "description": "This subject introduces students to cloud computing fundamentals. Following a brief introduction to cloud computing, the following topics are covered: cloud architecture, infrastructure-as-a-service, platform-as-a-service, software-as-a-service, virtualisation and multi-tenancy. For the first assignment, students are expected to work in a group and develop a research report that critically analyses an aspect of cloud computing. Subsequently, students are exposed to cloud-based software engineering skills using an existing cloud platform. For the second assignment, students are expected to work in a group and develop a cloud-based software application."
    },
    {
        "subject": "Cloud Computing Infrastructure ",
        "link": "https://handbook.uts.edu.au/subjects/41891.html",
        "description": "Complementing the existing cloud computing subjects, this subject introduces the concepts and implementation of cloud computing infrastructure. Topics such as cloud architecture, virtualisation and storage technologies, and data centre fundamentals, as well as security and compliance in the cloud, are explored. This subject is heavily influenced by industry interaction, and includes hands-on labs and workshops using commonly found tools within the cloud infrastructure industry."
    },
    {
        "subject": "Collaborative Business Processes ",
        "link": "https://handbook.uts.edu.au/subjects/31247.html",
        "description": "This undergraduate subject allows students to explore a problem and work through an end-to-end problem solving process. It introduces methods that can be used by agile teams to support the creativity, critical thinking and design that characterise innovation, and ways to apply these to real world problems. Starting from scoping a chosen problem, students develop a deeper understanding, supported by data and evidence. The subject introduces the support tools that allow teams to collaborate across distance and ways to adapt social networking for knowledge sharing and innovation. Students apply various tools to understand the problem and generate effective solution(s), such as design thinking, process modelling, systems thinking, business modelling, etc. It encourages students to share knowledge and quickly develop solutions that address current and emergent issues in society or business."
    },
    {
        "subject": "Communication for IT Professionals ",
        "link": "https://handbook.uts.edu.au/subjects/31265.html",
        "description": "This subject develops students' professional information technology practice skills within the context of a real-life technology project, through the Engineers Without Borders (EWB) Challenge. Students work in teams to create an appropriate design solution for a given problem as set out in the EWB Challenge Design Brief. While appreciating the central role of effective communication and teamwork in IT practice, students develop an understanding of the ethical, social, cultural, economic and environmental responsibilities of an IT professional. This subject is a starting point for students' ongoing professional development that they undertake throughout their studies and as an IT professional in their career. The skills introduced include understanding and applying principles and theories of human communication; researching the various discipline areas that inform the development of a design solution; identifying, formulating and designing a solution to solve a problem while considering ethical and socio-technical issues; written and oral communication for IT contexts; expressing technology concepts through visual communication; and, leading and participating in team processes. This subject provides multiple formative assessment opportunities for students to receive feedback and develop their work before submitting a summative team assessment."
    },
    {
        "subject": "Complex Data Analysis and Design ",
        "link": "https://handbook.uts.edu.au/subjects/42081.html",
        "description": "Industrial systems are getting increasingly complex due to the presence of technical, social and environmental subsystems. As such complex data analyses and design play an important role in supporting critical decisions. This subject introduces advanced analytical techniques required for modern day smart information modelling approach. Discussion and hands-on exercises related to these topics equip students to meet data analysis challenges in complex environments. This also helps students to appreciate the added challenges of dealing with unstructured data with appropriate commercial tools."
    },
    {
        "subject": "Complexity and Uncertainty ",
        "link": "https://handbook.uts.edu.au/subjects/42710.html",
        "description": null
    },
    {
        "subject": "Computer Game Design ",
        "link": "https://handbook.uts.edu.au/subjects/32003.html",
        "description": "Designing computer games is a challenging task. It is not as simple as just having an idea or jumping straight into coding or creating visual assets without a plan. A high-quality game design must be well structured and documented, carefully crafted for a specific target audience, communicated and negotiated with a team of other designers, scoped to be implementable by a given team of developers within time constraints, and evaluated and iterated on many times until a finely tuned game experience emerges. A professional game designer is an engineer of entertainment. Thus, in this subject, students will be taught the theoretical concepts and practical methodologies needed to ideate, communicate, implement, and improve upon your designs. In this way, students will learn to combine their existing software and game development skills with creativity and iterative design thinking to craft compelling interactions between players and the system of rules that govern them. Students will start by applying these theories and process to the creation of a physical board game prototype before moving on to creating a digital game in a popular game engine. This subject does not teach game development (e.g. coding or art asset creation) but instead requires students to self-learn what is needed to implement their group's shared vision. Students will adopt a kit-bashing approach to rapidly prototype and iterate on their game designs and playtest them with other students on a weekly basis to collect and analyse feedback. By the end of the session, students will have both a board game and digital game that are novel and refined, which can be used in future employment portfolios to highlight interaction design skills in entertainment domains."
    },
    {
        "subject": "Computer Graphics ",
        "link": "https://handbook.uts.edu.au/subjects/32501.html",
        "description": "This subject helps students develop problem-solving and communication skills in the context of computer graphics, including shape representation, manipulation and visualisation. It helps students enhance their skills to design and implement three-dimensional (3D) computer images, such as those used in animated films, virtual reality (VR), data visualisation and computer games. This subject aims to give students a balance of theory and practice, both of which are important to the understanding of and efficient development with computer graphics technology. Students learn fundamental principles of graphical pipelines and representations and put them into practice in the modern context of WebGL via the ThreeJS framework. By completing this subject, students gain valuable knowledge of the underlying graphical systems of game engines and 3D animation software, as well as skill in creating interactive 3D web applications that can be applied to a broad range of future studies and careers."
    },
    {
        "subject": "Computing Science Studio 1 ",
        "link": "https://handbook.uts.edu.au/subjects/41078.html",
        "description": "Computer scientists grapple with difficult computational problems, from fast and efficient compression algorithms to finding the fastest route home in the evening. This studio subject immerses students in some of the interesting challenges that they face by replicating and expanding on a research result from the computing science literature, under the mentorship of leading researchers from UTS. Students also focus on skill development for their careers in computing science – developing the communication skills necessary for academic and professional communication, the ethical principles required of modern IT professionals, and the analytical skills needed for the critical use of academic literature."
    },
    {
        "subject": "Computing Science Studio 2 ",
        "link": "https://handbook.uts.edu.au/subjects/41079.html",
        "description": "This is a studio-based subject in which students apply knowledge and skills learned in prerequisite subjects. Computer scientists work on a variety of problems and the challenges they face in their research are very often cross-disciplinary ones. They work on very fundamental problems such as how to model complex software systems as well as on applied and practical solutions, e.g. how to build early-warning systems for detecting customer churn, or how to recommend what movies to watch. This studio-based subject immerse students in some of the interesting challenges that they face by finding their own research topic and developing a study from its conceptualisation and literature review, through execution, to the final verification and validation. Students have an opportunity to be guided by the leading researchers from UTS. Students also focus on further skill development for their careers in computing science, developing the communication skills necessary for academic and professional communication, the ethical principles required of modern IT professionals, and the analytical skills needed for the critical use of academic literature. This subject is an extension of the 41078 Computing Science Studio 1."
    },
    {
        "subject": "Cybersecurity ",
        "link": "https://handbook.uts.edu.au/subjects/32548.html",
        "description": "This subject consolidates the student's understanding of cyber security by considering security principles, methodologies and technologies from a technical and management perspective used in practice. The subject allows students to learn about and discuss various cyber attack techniques used in practice, and methods to defend against such attacks using industry standard tools and techniques. Topics include cyber attacks and defenses, web security, firewalls, intrusion detection systems along with security services such as confidentiality, integrity, authentication (CIA) and technologies such as IPSec, SSL, PGP and S/MIME."
    },
    {
        "subject": " Data Analytics Foundations ",
        "link": "https://handbook.uts.edu.au/subjects/42821.html",
        "description": "Data analytics is the art and science of turning large quantities of usually incomprehensible data into meaningful and commercially valuable information. It is the basis of modern computer analytics and intelligence. It includes a number of IT areas, such as statistical methods for identifying patterns in data and making inferences; database technologies for managing the data sets to be mined; a range of intelligent technologies that derive automatically patterns from data; and visualisation and other multimedia techniques that support human pattern discovery capabilities.  Data Analytics Foundations introduces learners to the significance and language of data analytics for business and society and the most common approach to data mining called cross-industry standard process for data mining, known as CRISP-DM. This microcredential offers practice in the foundations of data analytics; identifying data set types and attribute types, data preparation and cluster analysis. Advanced techniques for clustering develop skills in identifying problems for cluster analysis and a range of approaches to address these limitations. Applying these data analytics techniques enables interpretation of a data set and visual data exploration."
    },
    {
        "subject": "Data Analytics in Cyber Security ",
        "link": "https://handbook.uts.edu.au/subjects/41180.html",
        "description": "This subject introduces data?driven methods capable of either compromising or hardening corporate computer and network defences. These techniques use different approaches to cyber?security, focusing on examining computer system data to search for intrusion vectors. Applying appropriate security and penetration testing techniques to obtain key test results is a crucial input to these algorithms. "
    },
    {
        "subject": "Data Driven and Intelligent Robotics ",
        "link": "https://handbook.uts.edu.au/subjects/41077.html",
        "description": "Intelligent robots are a disruptive technology poised to transform business and society. However, developing intelligent robot behaviours is different to traditional business applications. Intelligent robots are real-time distributed systems that must make complex real-time decisions autonomously using data collected from a wide range of sources such as sensors and the internet. To deal with this complexity, professionals must not only make sense of complexity, context and social norms in real-world scenarios, but translate such insights to algorithms suitable for autonomous use by a robot. In this subject, students work in groups to implement intelligent robot behaviours to solve a challenging real-world problem. Through this exercise, students develop their expertise in data analytics and machine learning. They develop an appreciation for the complexity, technical challenges and ethical issues associated with developing real-time data-driven intelligent systems. They gain an ability to recognise and select state-of-the-art algorithms, methodologies, techniques, experimental tools and evaluation methods. Students who complete this subject are ready to be productive members and thought-leaders in teams building the next generation of intelligent systems to transform business and society."
    },
    {
        "subject": "Data Driven Decision Making ",
        "link": "https://handbook.uts.edu.au/subjects/42711.html",
        "description": null
    },
    {
        "subject": "Data Processing Using Python ",
        "link": "https://handbook.uts.edu.au/subjects/420047.html",
        "description": "The subject focuses on the basics of python programming with practical application to data processing and analysis. Students will learn basic programming concepts, simple visualization, object-oriented programming techniques, and how to write custom programs using iPython notebooks. Additionally, this subject introduces the usage of the Numpy package to pre-process data, and machine learning techniques will be introduced to facilitate further exploration of the Python language capabilities. "
    },
    {
        "subject": "Data Processing Using Python ",
        "link": "https://handbook.uts.edu.au/subjects/42047.html",
        "description": "The subject focuses on the basics of python programming with practical application to data processing and analysis. Students will learn basic programming concepts, simple visualization, object-oriented programming techniques, and how to write custom programs using iPython notebooks. Additionally, this subject introduces the usage of the Numpy package to pre-process data, and machine learning techniques will be introduced to facilitate further exploration of the Python language capabilities. "
    },
    {
        "subject": "Data Processing Using R ",
        "link": "https://handbook.uts.edu.au/subjects/420046.html",
        "description": "R is a very popular high-level programming language for doing data analytics, statistics and interactive visualisation. It is an interpreted, object-oriented and interactive scripting language. R’s high-level built-in data structures make it suitable for rapid application development. R's functional programming features make it a very expressive language. It is widely used for statistics, scientific and numeric computing, education, software development, and interactive visualisation applications. This subject covers the basics of using R, including programming constructs, packages and object-oriented programming. Useful R analysis procedures for data analytics are also introduced."
    },
    {
        "subject": "Data Processing Using R ",
        "link": "https://handbook.uts.edu.au/subjects/42046.html",
        "description": "R is a very popular high-level programming language for doing data analytics, statistics and interactive visualisation. It is an interpreted, object-oriented and interactive scripting language. R’s high-level built-in data structures make it suitable for rapid application development. R's functional programming features make it a very expressive language. It is widely used for statistics, scientific and numeric computing, education, software development, and interactive visualisation applications. This subject covers the basics of using R, including programming constructs, packages and object-oriented programming. Useful R analysis procedures for data analytics are also introduced."
    },
    {
        "subject": "Data Structures and Algorithms ",
        "link": "https://handbook.uts.edu.au/subjects/31251.html",
        "description": "This subject teaches students how to design, develop and evaluate data structures and algorithms to meet predefined quality characteristics of functionality (suitability) and usability (understandability, learnability, operability, compliance). Software solutions are implemented using C++. Concepts, theories and technologies underlying the methods and techniques are introduced and explained as required."
    },
    {
        "subject": "Data Visualisation and Visual Analytics ",
        "link": "https://handbook.uts.edu.au/subjects/32146.html",
        "description": "This subject covers the core data visualisation and visual interaction (or navigation) technologies that support the visual analytics and decision-making processes. Students study the latest data visualisation articles and the practice of cutting-edge data visualisation and visual analysis software. The subject provides an essential understanding of the procedure (loop) and the methodology of visual data analytics. It discusses the human involvement (or input) in the loop of analytical reasoning facilitated by interactive visual interfaces. On successful completion of this subject, students are capable of designing and evaluating various advanced visualisation interfaces that can be directly applied into the loop of visual data mining or visual analytics to enable them to become data visualisation designers and visual data analysts."
    },
    {
        "subject": "Data Visualisation and Visual Analytics ",
        "link": "https://handbook.uts.edu.au/subjects/320146.html",
        "description": "This subject covers the core data visualisation and visual interaction (or navigation) technologies that support the visual analytics and decision-making processes. Students study the latest data visualisation articles and the practice of cutting-edge data visualisation and visual analysis software. The subject provides an essential understanding of the procedure (loop) and the methodology of visual data analytics. It discusses the human involvement (or input) in the loop of analytical reasoning facilitated by interactive visual interfaces. On successful completion of this subject, students are capable of designing and evaluating various advanced visualisation interfaces that can be directly applied into the loop of visual data mining or visual analytics to enable them to become data visualisation designers and visual data analysts."
    },
    {
        "subject": "Database ",
        "link": "https://handbook.uts.edu.au/subjects/32606.html",
        "description": "This subject introduces students to basic database design and implementation concepts, database design techniques, and using a relational design via an entity relationship diagram, including how to interpret an entity relationship diagram. Students learn how to access a database via structured query language (SQL) to retrieve data from the database. The code required to implement a database is also covered."
    },
    {
        "subject": "Database ",
        "link": "https://handbook.uts.edu.au/subjects/320606.html",
        "description": "This subject introduces students to basic database design and implementation concepts, database design techniques, and using a relational design via an entity relationship diagram, including how to interpret an entity relationship diagram. Students learn how to access a database via structured query language (SQL) to retrieve data from the database. The code required to implement a database is also covered."
    },
    {
        "subject": "Database Fundamentals ",
        "link": "https://handbook.uts.edu.au/subjects/31271.html",
        "description": "This subject introduces students to the fundamentals of effective database systems. Students are taught how data is structured and managed in an organisation in a way that can be used effectively by applications and users. They also learn to use the language SQL for effective data retrieval and modification. This subject teaches students to appreciate the significance and challenges of good database design and management, which underpin the development of functional software applications."
    },
    {
        "subject": "Database Principles ",
        "link": "https://handbook.uts.edu.au/subjects/31061.html",
        "description": "This subject introduces the students to basic database design and implementation concepts, database design techniques, and using a relational design via Entity Relationship Diagram. This subject also includes how to interpret an Entity Relationship Diagram. Students learn how to access a database via Structured Query Language (SQL) to retrieve data from the database. The code required to implement a database is also covered in this subject. This subject requires significant preparation before students come to the lectures. Practical exercises are covered during the labs."
    },
    {
        "subject": "Database Programming ",
        "link": "https://handbook.uts.edu.au/subjects/31253.html",
        "description": "This subject teaches students how to design, develop and evaluate database programming and administration solutions to meet pre-defined quality characteristics of functionality (suitability, security), usability (operability), efficiency (time behaviour, resource utilisation), and maintainability (changeability, testability). Database programming and administration solutions are implemented using Oracle 11G, SQL*Plus and PL/SQL. Concepts, theories and technologies underlying the methods and techniques are introduced and explained as required. Students apply all that they have learnt to develop a small application to solve a database problem."
    },
    {
        "subject": "Deep Learning and Convolutional Neural Network ",
        "link": "https://handbook.uts.edu.au/subjects/42028.html",
        "description": "The subject focuses on state-of-the-art research on deep learning and convolutional neural networks (CNNs) with practical applications. Recent advances in neural network approaches have significantly increased the performance of state-of-the-art data analytics, image recognition and object detection systems. This subject presents the details of deep learning architectures with a focus on learning end-to-end models for tasks, particularly image classification and object detection. State-of-the-art software tools are discussed and used for the implementation of image classification systems. Labs focus on setting-up deep learning libraries for image classification and object detection problems, and fine-tuning trained networks. Students learn to implement, train and test their own deep CNNs from scratch on GPUs. Student also explore how to deploy the trained models and build an AI system. Students demonstrate comprehension of state-of-the-art research individually, and then work in groups to apply them to the implementation of an image classification and object detection systems."
    },
    {
        "subject": "Digital Experience Design Studio ",
        "link": "https://handbook.uts.edu.au/subjects/95566.html",
        "description": null
    },
    {
        "subject": "Digital Forensics ",
        "link": "https://handbook.uts.edu.au/subjects/32309.html",
        "description": "This is a practice-based subject, using material based on the textbooks. Learning is laboratory-based. Students assess if a crime has been committed, acquire digital evidence, analyse the evidence and prepare forensic reports. The emphasis is on digital forensics applications, in particular:  forensic analysis of a digital storage device where evidence of visits to web sites is recovered to support or oppose a hypothesis before a criminal court eDiscovery (a form of discovery related to civil litigation) where students acquire evidence of contact with a third party using email or social media intrusion investigation into the nature and extent of an unauthorised network intrusion. Students look for evidence of malware being installed on the device that may use the network to exfiltrate data to an unauthorised person. "
    },
    {
        "subject": "Digital Media Technologies ",
        "link": "https://handbook.uts.edu.au/subjects/95564.html",
        "description": "This subject provides an overview of some of the software and hardware technologies utilised in the development and maintenance of moderately complex websites exhibiting sophisticated interactivity and requiring a systematic approach to management.\nIt provides an opportunity for students to demonstrate an understanding of the skills and issues relevant to the creation and management of websites of moderate complexity. These skills may include HTML authoring, CSS design, browser scripting with JavaScript, interaction with back-end database environments using scripting engines such as PHP, database management systems such as MySQL, and other skills as appropriate."
    },
    {
        "subject": "Directed Study 1 ",
        "link": "https://handbook.uts.edu.au/subjects/31008.html",
        "description": "This subject is a small group subject that covers a specialist topic at an advanced level.  The topic of an individual subject is chosen by the subject coordinator.  There are no set lectures; instead, the students and the coordinator meet once a week to discuss the topic."
    },
    {
        "subject": "Directed Study 1 ",
        "link": "https://handbook.uts.edu.au/subjects/32019.html",
        "description": "This subject is a small group subject that covers a specialist topic at an advanced level. The topic of an individual subject is chosen by the subject coordinator. There are no set lectures; instead, the students and the coordinator meet once a week to discuss the topic."
    },
    {
        "subject": "Directed Study 2 ",
        "link": "https://handbook.uts.edu.au/subjects/32020.html",
        "description": "This subject is a small group subject that covers a specialist topic at an advanced level. The topic of an individual subject is chosen by the subject coordinator. There are no set lectures; instead, the students and the coordinator meet once a week to discuss the topic."
    },
    {
        "subject": "Directed Study 2 ",
        "link": "https://handbook.uts.edu.au/subjects/31009.html",
        "description": "This subject is a small group subject that covers a specialist topic at an advanced level.  The topic of an individual subject is chosen by the subject coordinator.  There are no set lectures; instead, the students and the coordinator meet once a week to discuss the topic."
    },
    {
        "subject": "Directed Study 3 ",
        "link": "https://handbook.uts.edu.au/subjects/32021.html",
        "description": "This subject is a small group subject that covers a specialist topic at an advanced level. The topic of an individual subject is chosen by the subject coordinator. There are no set lectures; instead, the students and the coordinator meet once a week to discuss the topic."
    },
    {
        "subject": "Directed Study 3 ",
        "link": "https://handbook.uts.edu.au/subjects/31010.html",
        "description": "This subject is a small group subject that covers a specialist topic at an advanced level.  The topic of an individual subject is chosen by the subject coordinator.  There are no set lectures; instead, the students and the coordinator meet once a week to discuss the topic."
    },
    {
        "subject": "Directed Study 4 ",
        "link": "https://handbook.uts.edu.au/subjects/31013.html",
        "description": "This subject is a small group subject that covers a specialist topic at an advanced level.  The topic of an individual subject is chosen by the subject coordinator.  There are no set lectures; instead, the students and the coordinator meet once a week to discuss the topic."
    },
    {
        "subject": "Directed Study 4 ",
        "link": "https://handbook.uts.edu.au/subjects/32022.html",
        "description": "This subject deals with issues involved in strategic level analysis and design in a corporate information systems environment. Through a major case study, it reinforces material previously studied, while giving groups of students scope to use their own judgement in applying their knowledge. It stresses the development and assessment of alternative approaches to a system strategy. Senior management and communication skills are also developed."
    },
    {
        "subject": " Emerging Topics in Artificial Intelligence ",
        "link": "https://handbook.uts.edu.au/subjects/41041.html",
        "description": "This subject helps students develop good understanding of the concepts and related algorithms in emerging topics in Artificial Intelligence (AI). It is suitable for students who are enthusiastic about AI and keen to do research in AI areas. Most emerging AI topics and their applications will be discussed. Students have opportunities to explore their selected most favourite topics through literature reviews, group discussions and/or experimental investigation if applicable. Students need to demonstrate their good understanding of their chosen topics through, class engagement, a research report and an oral presentation."
    },
    {
        "subject": "Emerging Topics in Cyber Security and Privacy ",
        "link": "https://handbook.uts.edu.au/subjects/41185.html",
        "description": "This subject covers the emerging topics in professional and industrial cybersecurity fields, especially the contemporary IT security theories and practical skills by series of guest lectures and workshops. Students develop a professional understanding of Cybersecurity through investigating emerging threats and vulnerabilities of web applications and systems, cutting-edge privacy and ethical issues, and analysing the latest system security approaches. Current trends and challenges in Cybersecurity are explored through studying professional practice and reviewing research literature. Students apply contemporary requirements elicitation, analysis, modelling, specification, and validation techniques to real project in small teams."
    },
    {
        "subject": "Emerging Topics in Quantum Information Science ",
        "link": "https://handbook.uts.edu.au/subjects/41175.html",
        "description": "This subject covers emerging topics in research and industrial quantum computing and information science by guest lectures and workshops. Students develop an advanced understanding of cutting-edge topics in quantum computing through investigating the key topics driving industry-leading research, new research breakthroughs, and consolidating advanced techniques in the quantum information sciences. Current trends and challenges in quantum computing are explored through studying professional practice and reviewing research literature. Students will learn to apply current best-practice in quantum computing analysis, modelling, and experimental methods via engaging in workshops and small-team discussions. "
    },
    {
        "subject": "Enabling Enterprise Information Systems ",
        "link": "https://handbook.uts.edu.au/subjects/32557.html",
        "description": "This postgraduate subject introduces students to the uses of information systems in generating business value for organisations. It deals with the different types of enterprise information requirements, application of information systems to business problems, and recent developments and technologies in the marketplace. Emphasis is on organisational strategies for information systems, mobile, cloud and social computing, and design activities including working in design teams. "
    },
    {
        "subject": "Enabling Enterprise Information Systems ",
        "link": "https://handbook.uts.edu.au/subjects/320557.html",
        "description": "This postgraduate subject introduces students to the uses of information systems in generating business value for organisations. It deals with the different types of enterprise information requirements, application of information systems to business problems, and recent developments and technologies in the marketplace. Emphasis is on organisational strategies for information systems, mobile, cloud and social computing, and design activities."
    },
    {
        "subject": "Enterprise Architecture Practice ",
        "link": "https://handbook.uts.edu.au/subjects/32570.html",
        "description": "This subject introduces students to the fundamentals of enterprise architecture for architecting software-intensive systems at the large enterprise scale. Current trends and challenges in the practice of enterprise architecture are explored. In small teams, students apply contemporary enterprise architecture practices to their architecture project work. Students learn to integrate and align different enterprise architecture layers to better support the business goals and objectives."
    },
    {
        "subject": "Enterprise Business Requirements ",
        "link": "https://handbook.uts.edu.au/subjects/32569.html",
        "description": "This subject introduces students to the processes, methods and tools that support the human-centred and communication-rich part of software and system development called requirements engineering (RE), also known as business analysis in practice. Current trends and challenges in RE are explored through studying professional practice and reviewing research literature. Students apply contemporary requirements elicitation, analysis, modelling, specification and validation techniques to case studies in small teams."
    },
    {
        "subject": "Enterprise Process Management ",
        "link": "https://handbook.uts.edu.au/subjects/41188.html",
        "description": "This subject introduces contemporary enterprise process management, with the primary emphasis on process-centric value creation. Introducing principles and practices of Business Process Management (BPM), the subject extends the process management beyond business. As such it is designed to equip students with knowledge and skills to solve process-related problems and innovate processes in a variety of domains (e.g. health, education, transportation, humanitarian aid, disaster management and so on). Students then develop practical skills in modelling, redesigning and ethical innovation of enterprise processes in various organisational settings. Building upon Business Process Management (BPM), the subject extends the process management beyond business and equips the students to apply their knowledge and skills to a variety of problems within and beyond any type of organisation in a variety of domains (eg health, education, transportation, humanitarian aid, disaster management and so on). Students develop a detailed understanding of the concepts, strategies, tools and technologies required for modelling, analysis, design, improvement, integration, performance measurement and governance of enterprise processes (both intra- and inter-enterprise) in any organisational and/or value chain context and relevant industry standards. Students develop practical skills in modelling, redesigning and improving enterprise processes using various BPM software tools/suites. "
    },
    {
        "subject": "Enterprise Software Testing ",
        "link": "https://handbook.uts.edu.au/subjects/32571.html",
        "description": "This subject provides students with the practical knowledge and skills that are necessary to effectively measure and control the quality of software products. It covers software quality assurance and management principles and practice together with systems and software testing approaches."
    },
    {
        "subject": "Exchange Elective 1 (Information Technology) ",
        "link": "https://handbook.uts.edu.au/subjects/90001.html",
        "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject."
    },
    {
        "subject": "Exchange Elective 2 (Information Technology) ",
        "link": "https://handbook.uts.edu.au/subjects/90002.html",
        "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject."
    },
    {
        "subject": "Exchange Elective 3 (Information Technology) ",
        "link": "https://handbook.uts.edu.au/subjects/90003.html",
        "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject."
    },
    {
        "subject": "Exchange Elective 4 (Information Technology) ",
        "link": "https://handbook.uts.edu.au/subjects/90004.html",
        "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject."
    },
    {
        "subject": "Exchange Elective 5 (Information Technology) ",
        "link": "https://handbook.uts.edu.au/subjects/90005.html",
        "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject."
    },
    {
        "subject": "Exchange Elective 6 (Information Technology) ",
        "link": "https://handbook.uts.edu.au/subjects/90006.html",
        "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject."
    },
    {
        "subject": "Exchange Elective 7 (Information Technology) ",
        "link": "https://handbook.uts.edu.au/subjects/90007.html",
        "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject."
    },
    {
        "subject": "Exchange Elective 8 (Information Technology) ",
        "link": "https://handbook.uts.edu.au/subjects/90008.html",
        "description": "This subject is used for the purpose of enrolling students participating in the UTS Global Exchange Program. The program offers students the opportunity to complete one or two sessions of study with an international exchange partner institution and receive credit towards their course at UTS. Applicants must have their study at the partner institution approved by the faculty prior to enrolment in this subject."
    },
    {
        "subject": " Finance and IT Professionals ",
        "link": "https://handbook.uts.edu.au/subjects/31255.html",
        "description": "This mid-stage undergraduate subject provides skills in financial management that are essential to any IT professional working in business today. Students gain knowledge of financial principles and an understanding of reporting requirements which are necessary for the evaluation and design of auditable financial systems. In addition, students develop key competencies in the financial aspects of IT management, outsourcing and project management including budgeting, statement analysis, feasibility and risk management."
    },
    {
        "subject": "Fundamentals of Data Analytics ",
        "link": "https://handbook.uts.edu.au/subjects/32130.html",
        "description": "Data analytics is the art and science of teasing meaningful information and patterns out of large quantities of data. It combines statistical methods for identifying patterns in data and making inferences with a number of IT technologies, including database technologies for handling massive volumes of data, intelligent and smart systems technologies, visualisation and other multimedia techniques that appeal to human pattern discovery capabilities. The subject offers broad background to data analytics and data mining methods and their application in practice. It brings together the state-of-the-art research and practice in related areas and provides students with the necessary knowledge and capacity to initiate and lead data analytics projects that can turn company data into commercially valuable information."
    },
    {
        "subject": "Fundamentals of Database and Software Development ",
        "link": "https://handbook.uts.edu.au/subjects/42038.html",
        "description": "Databases and software development are an integral part of the digital world we live in. Navigating opportunities in organizations which depend upon the development of digital solutions requires employees who have strong fundamental technical skills and professional capabilities which underpin specific position requirements. Fundamentals of Databases and Software Development offers such a grounding on which to build adaptive skills to a continuously evolving digital world. "
    },
    {
        "subject": "Fundamentals of Information Systems ",
        "link": "https://handbook.uts.edu.au/subjects/42080.html",
        "description": "Appropriate use of information is the key to organisational sustainability and growth in today’s world. This introductory subject imparts students with the fundamental knowledge of key concepts in information systems. It introduces students to the functional dynamics in an organisation and how information system supports them. The subject highlights the key technology, business systems available in current practices. It helps them to understand how to acquire and develop solutions to business challenges using technology and systems. The subject also introduces the concepts of socially responsible use of information encompassing privacy, security, and social impacts of information."
    },
    {
        "subject": "Fundamentals of Interaction Design ",
        "link": "https://handbook.uts.edu.au/subjects/31260.html",
        "description": "This subject focuses on the design, evaluation and implementation of interactive computing systems for human use within actual situations. Students gain an understanding of human–computer interaction (HCI) and interaction design principles, including the main concepts, tools and techniques available to build human-centred systems. The subject considers the effects of the different metaphors for human activity that designers use in their systems and how human-centred design and evaluation methods can improve the usability of computer systems."
    },
    {
        "subject": "Fundamentals of Interaction Design ",
        "link": "https://handbook.uts.edu.au/subjects/42017.html",
        "description": "This subject focuses on the design, evaluation and implementation of interactive computing systems for human use within actual situations. Students gain an understanding of human–computer interaction (HCI) and interaction design principles, including the main concepts, tools and techniques available to build human-centred systems. The subject considers the effects of the different metaphors for human activity that designers use in their systems and how human-centred design and evaluation methods can improve the usability of computer systems."
    },
    {
        "subject": "Fundamentals of Software Development ",
        "link": "https://handbook.uts.edu.au/subjects/32555.html",
        "description": "This subject introduces students to the software development process and its different stages. It aims to develop the understanding of object-oriented systems development from specifications to code writing and testing. Students develop the skills to write user specifications; the ability to model and design software systems according to industry standards; and the ability to code and build software applications. The subject also aims to develop students' teamwork skills by allowing them to work in project teams and use a real-life case study for software development."
    },
    {
        "subject": " Game Design Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42075.html",
        "description": "This studio subject focuses on the practical aspects of game design and development. It teaches students how to design, develop and implement a game based on client specifications. Students examine the game mechanics for multiple indie and experimental games in developing their own game mechanics. A player-centric approach to design is used where new ideas are tested continuously with end users. Students work in teams taking on roles similar to those found in game development companies. They work independently under supervision and with guidance but are ultimately responsible for the final project delivery and presentation."
    },
    {
        "subject": "Game Design Studio 1 ",
        "link": "https://handbook.uts.edu.au/subjects/31102.html",
        "description": "This studio subject focuses on the practical aspects of game design and development. It teaches students how to design, develop and implement a game based on client specifications. Students examine the game mechanics for multiple indie and experimental games in developing their own game mechanics. A player-centric approach to design is used where new ideas are tested continuously with end users. Students work in teams taking on roles similar to those found in game development companies. They work independently under supervision and with guidance but are ultimately responsible for the final project delivery and presentation."
    },
    {
        "subject": "Game Design Studio 2 ",
        "link": "https://handbook.uts.edu.au/subjects/31103.html",
        "description": "This studio subject focuses on the practical aspects of game design and development. Students work in multidisciplinary cross-faculty teams following Agile Project Management Principles (learned in 31102 Game Design Studio 1) to create innovative and unique commercial-quality video games. Each student plays a crucial role within their team allowing them to specialise and develop unique skills such as 3D modeling, scripting, level design, and music composition. All of these skills are highly relevant to the continuously evolving games industry. The intellectual property of the games developed belongs to the team and it is encouraged that some teams market their games after completion of the subject."
    },
    {
        "subject": "Game Development ",
        "link": "https://handbook.uts.edu.au/subjects/32004.html",
        "description": "This subject introduces game development through the use of a commercial-grade game engine. It aims to build a generalizable understanding of the theory of virtual interactive simulations, while also more specifically developing intermediate competence in programmatic problem solving within the Unity Game Engine. The subject includes exposure to common terminology used in the industry, an introduction to the core interface tools of an engine, experience in applying vector and matrix mathematics to transform virtual objects in 2D and 3D coordinate space, and a strong focus on programming in games through the use of an engine API. This establishes the skills required to successfully contribute to the development of significant group projects found in many of the subsequent games related subjects. "
    },
    {
        "subject": "Games and Graphics Project ",
        "link": "https://handbook.uts.edu.au/subjects/31248.html",
        "description": "This subject exposes students to working on a research project in the broad fields of games or computer graphics. Students experience working independently on an authentic project with a focus on innovation and knowledge discovery in digital media design and development. The subject also develops students' capabilities in planning, accountability, and self-motivation through the management of a project from initial brainstorming and consultation, to prototype development and analysis. The intent of this subject is to prepare students for employment in a real-world games-related workplace where bespoke solutions are often needed for unique design and development problems, requiring creativity, ingenuity, and self-driven learning and problem-solving skills. It is also a representative example of the type of research that may be experienced in an Honours year, postgraduate research, or a career in games and graphics research."
    },
    {
        "subject": "Games Research Project ",
        "link": "https://handbook.uts.edu.au/subjects/42056.html",
        "description": "This subject exposes students to working on a research project in the broad fields of games or computer graphics. Students experience working independently on an authentic project with a focus on innovation and knowledge discovery in digital media design and development. The subject also develops students' capabilities in planning, accountability, and self-motivation through the management of a project from initial brainstorming and consultation, to prototype development and analysis. The intent of this subject is to prepare students for employment in a real-world games-related workplace where bespoke solutions are often needed for unique design and development problems, requiring creativity, ingenuity, and self-driven learning and problem-solving skills. It is also a representative example of the type of research that may be experienced in an Honours year, postgraduate research, or a career in games and graphics research."
    },
    {
        "subject": "Global Information Systems ",
        "link": "https://handbook.uts.edu.au/subjects/32531.html",
        "description": "This subject covers new requirements placed on information systems arising out of the globalisation of business operations. It covers new ways of doing business in global environments, including formation of alliances and joint ventures, and ways that information systems must be developed to support them. The interaction of technical issues and social issues, including culture, is studied."
    },
    {
        "subject": "Global Issues Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42701.html",
        "description": null
    },
    {
        "subject": "Global Negotiations ",
        "link": "https://handbook.uts.edu.au/subjects/42712.html",
        "description": null
    },
    {
        "subject": "Global Technology Issues Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42039.html",
        "description": null
    },
    {
        "subject": "Graduate Research Project (12cp in one session) ",
        "link": "https://handbook.uts.edu.au/subjects/42072.html",
        "description": "For further details, contact UTS: Information Technology."
    },
    {
        "subject": "Graduate Research Project (24cp in one session) ",
        "link": "https://handbook.uts.edu.au/subjects/42071.html",
        "description": "For further details, contact UTS: Information Technology."
    },
    {
        "subject": "Graduate Research Project 24cp (Part 1 of 2) (2 x 12cp) ",
        "link": "https://handbook.uts.edu.au/subjects/42073.html",
        "description": "For further details, contact UTS: Information Technology."
    },
    {
        "subject": "Graduate Research Project 24cp (Part 2 of 2) (2 x 12cp) ",
        "link": "https://handbook.uts.edu.au/subjects/42074.html",
        "description": "For further details, contact UTS: Information Technology."
    },
    {
        "subject": " Honours Project ",
        "link": "https://handbook.uts.edu.au/subjects/31482.html",
        "description": "This subject is undertaken in the second part of the honours program. Students finalise their research project based on what they studied in the first part of their honours program. This involves a substantial investigation or creative work under the supervision of a member of academic staff and is examined based on the reflection, pitch, report and the work itself. Students learn to:  implement proposed research in an independent and competent manner, and present the research in a manner that demonstrates competencies in conducting research and presenting the outcomes in a scholarly manner. "
    },
    {
        "subject": "Human-centred Design and Systems Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42703.html",
        "description": null
    },
    {
        "subject": "Human-centred Design Methods ",
        "link": "https://handbook.uts.edu.au/subjects/41020.html",
        "description": "When designing an interactive product, the designer should know who they are designing for and their needs, wishes and abilities. This is how human-centred design makes people central to the design process. There are many human-centred design methods and several of them are touched on in other interaction design subjects. In this subject we give an overview of the breadth of these methods and focus on two different methods: interviewing and cultural probes. Interviewing is one of the most popular methods in human-centred design. The many reasons include the fact that interviewing provides direct information from interviewees, is relatively easy to do (though difficult to do well) and is inexpensive. The interviewing method is flexible in its use, exists in a large number of variations and can be used at any stage of the design process. Cultural probes, by contrast, is a design method that requires sets of props (probes) which are specifically created or collected to be issued to participants to elicit their response. This method is open and creative, and needs more preparation, but has the potential to generate inspirational responses that can inform design. In this subject students implement both the interviewing method and the cultural probe method, step-by-step through guidance. Students are given a brief to guide their interviewing and cultural probe implementation. Examples are shared of different types of interview and probe methods, and the student can choose to implement the ones that fit their goal best. Students have to recruit their own study participants, at least three to interview and one for the probe study."
    },
    {
        "subject": "Human-Centred Design Research Methods ",
        "link": "https://handbook.uts.edu.au/subjects/32405.html",
        "description": null
    },
    {
        "subject": " Image Processing and Pattern Recognition ",
        "link": "https://handbook.uts.edu.au/subjects/31256.html",
        "description": "Images and videos contain enormous amounts of information that can be extracted automatically by means of image processing and pattern recognition techniques. The extracted information is at the basis of many innovative applications such as video surveillance, diagnosis from medical images, automatic indexing and retrieval of multimedia data, human-computer interaction. This subject gives students the ability to understand the principles of image processing and pattern recognition and develop software for the automatic analysis and interpretation of images and videos. The goal of this subject is to teach skills used by professional engineers working at developing image processing and computer vision products, services and solutions. During the project students apply the knowledge they have gained to scope, solve, test and communicate a solution to a real-world image processing problem in a collaborative team-based environment. Examples include detection of people and objects in video surveillance, automated diagnosis from medical images, and detection and recognition of faces in imagery."
    },
    {
        "subject": "Industry Experience 1 ",
        "link": "https://handbook.uts.edu.au/subjects/41015.html",
        "description": "The emphasis of this subject is learning by doing. The subject enables the student to apply and extend the knowledge foundations acquired in first session to workplace projects of the sponsoring organisation. In this process students understand where and how theoretical knowledge is applied and where workplace practice should inform theory. Students are mentored by both the industry professionals and university academics during this session. Students also participate in a number of formal and informal classes at the university and sponsoring organisations where they share their experiences and exchange ideas to enhance their practical learning."
    },
    {
        "subject": "Industry Experience 1 (BIT) ",
        "link": "https://handbook.uts.edu.au/subjects/41049.html",
        "description": "This subject is undertaken while the student is on work placement. Students engage in informal and formal academic and industry mentor meetings. They build a learning contract to solve an interesting problem or opportunity in the workplace, in consultation with both academic and industry mentors.  The student is required to do a short presentation at the workplace in the presence of industry and academic mentors. "
    },
    {
        "subject": "Industry Experience 2 ",
        "link": "https://handbook.uts.edu.au/subjects/41016.html",
        "description": "This subject is the second industry placement in the Bachelor of Information Technology. Students are placed with a different sponsor and in an alternative role from their first placement in order to gain a broader view of the industry and information technology careers. It also includes a number of sessions at university where students share their experiences of the various industry sectors and attempt to consolidate their experiences gained from their industry placements."
    },
    {
        "subject": "Industry Experience 2 (BIT) ",
        "link": "https://handbook.uts.edu.au/subjects/41050.html",
        "description": "In this subject, students learn, improve and apply selected workplace skills. Whilst on a work placement, students develop a learning contract by selecting several professional skills of interest and that they can extend to SFIA level 4 (enable). Workplace projects and problems provide a context in which the selected skills can be learnt, improved and applied, and the consequences of application used to extend the student's understanding. The student’s experiences contribute to develop a portfolio of evidence of their level of expertise in their selected skills. "
    },
    {
        "subject": "Industry Project ",
        "link": "https://handbook.uts.edu.au/subjects/32040.html",
        "description": "This subject deals with issues involved in strategic level analysis and design in a corporate information systems environment. Through a major case study, it reinforces material previously studied, while giving groups of students scope to use their own judgement in applying their knowledge. It stresses the development and assessment of alternative approaches to a system strategy. Senior management and communication skills are also developed."
    },
    {
        "subject": "Industry Project 1 ",
        "link": "https://handbook.uts.edu.au/subjects/31491.html",
        "description": "This subject enables students to extend the knowledge foundations acquired in first session by gaining hands-on experience while performing different IT role(s) in different teams or areas (such as business analysis, development, testing, support, etc.) of the sponsoring organisation. This subject provides students with their first formal experience in the IT industry, making use of the skills and knowledge gained in their first session of study. In this process, students learn to link and apply theory to practice."
    },
    {
        "subject": "Industry Project 2 ",
        "link": "https://handbook.uts.edu.au/subjects/31492.html",
        "description": "In this subject students apply their learning in practice. Workplace projects and problems provide a context in which theoretical knowledge and skills must be selected, applied and the consequences of application used to extend the student's understanding. Additionally some theoretical knowledge, particularly problem-solving and critical thinking, should be used to address novel problems and situations in order to produce sound useful outcomes. Students are expected to perform a number of work assignments so that they have the opportunity to apply a range of knowledge and skills to a range of problems and projects."
    },
    {
        "subject": "Industry Study 1 ",
        "link": "https://handbook.uts.edu.au/subjects/31489.html",
        "description": "In this workplace subject, students apply their academic knowledge and skills to a work project. The project is chosen in consultation with the student's industry and academic mentors and is intended to deepen the student's knowledge and showcase their intellectual skills. Most projects involve some element of novelty and require the student to select an appropriate method of investigation, design, development or problem solving. When this is done well the result is rigorous, often innovative, and provides a result that everyone can see is appropriate."
    },
    {
        "subject": "Industry Study 2 ",
        "link": "https://handbook.uts.edu.au/subjects/31490.html",
        "description": "In this workplace subject, students apply their academic knowledge and skills to a work project. The project is chosen in consultation with the student's industry and academic mentors and is intended to deepen the student's knowledge and showcase their intellectual skills. Most projects involve some element of novelty and require the student to select an appropriate method of investigation, design, development or problem solving. When this is done well the result is rigorous, often innovative, and provides a result that everyone can see is appropriate."
    },
    {
        "subject": "Information Security and Management ",
        "link": "https://handbook.uts.edu.au/subjects/41181.html",
        "description": "The key focus of this subject is to equip students with IT security policy development and human security management. This includes legal and ethical issues in the context of security management and audit. The subject provides students with the foundations required to apply cyber safety and security, and security management at a corporate level. Students conduct security assessments with business operational constraints using professional methods and strategies. The subject enables students to examine both business and security operations procedurally, and to develop contingency planning, risk assessment, risk management and compliance standards for various businesses. "
    },
    {
        "subject": "Information System Development Methodologies ",
        "link": "https://handbook.uts.edu.au/subjects/31257.html",
        "description": "Successfully designing and developing information systems is complex and difficult. A number of techniques and approaches have been developed but there are no 'silver bullet' solutions to the problems that plague IT development projects. This subject introduces students to a number of different methodologies and provides them with the skills they need to identify their strengths and weaknesses in key areas. These issues are of critical importance to those wishing to successfully manage software projects."
    },
    {
        "subject": "Information Systems Architecture Design ",
        "link": "https://handbook.uts.edu.au/subjects/32560.html",
        "description": "This postgraduate subject addresses the large questions raised by agile practice on the role of architects. It is of particular relevance to students who are questioning how useful architecture and design is in an agile world where accepted best practice is to “fail fast” and iterate quickly rather than follow carefully laid plans. More specifically, this subject introduces the student to two distinct forms of architecture:  Enterprise Architecture, which addresses the strategic question of how IT can best be utilised and aligned to support business needs. The subject focuses on a pragmatic form of enterprise architecture that accepts that organizations constantly evolve and that uncertainty is inescapable. This means that it is generally neither feasible nor desirable to design IT landscapes in exhaustive detail, and yet it would be risky to leave them to evolve at the whim of individual projects. Students learn which aspects of an organization are most useful to model, and develop a toolbox of artefacts to capture and communicate this information. Solution Architecture, which addresses the tactical question of how best to deliver specific IT solutions that best address specific business needs. This subject focuses on how architects and analysts can work effectively with agile development teams, to ensure that business needs and architectural concerns are not lost in the agile software development process that might otherwise focus exclusively on end-users. It helps students recognise when aspects of a system should be defined up-front, and when they are better left to be discovered through the agile process. Students learn how and when to apply proven architectural patterns, how to recognise and avoid common architecture problems, and how to model system architectures using diagrams that are useful and easy to understand. "
    },
    {
        "subject": "Information Systems Strategy ",
        "link": "https://handbook.uts.edu.au/subjects/32208.html",
        "description": "Information systems (IS) strategy is a key concern for both IT managers and managers of other business functions within enterprises. IS strategy is about effective planning of the use and utilisation of information systems resources and technologies to achieve organisational long-term objectives. Through presentation of key issues, case studies and presentations of students' own experiences, this postgraduate subject deals with the development, evaluation and impact of information systems in organisations; choices that, together, form part of IT and IS strategy."
    },
    {
        "subject": "Information Technology Strategy ",
        "link": "https://handbook.uts.edu.au/subjects/32703.html",
        "description": "IT strategy is a key concern for both IT managers and managers of other business functions within enterprises. Through a brief presentation of key issues, case studies and presentations of students' own experiences, this subject deals with the development, evaluation and impact of information systems in organisations; choices that, together, form part of IT and IS strategy."
    },
    {
        "subject": "Infrastructure for Cloud Computing ",
        "link": "https://handbook.uts.edu.au/subjects/42891.html",
        "description": "This subject introduces the concepts and implementation of cloud computing infrastructure, and complements the existing cloud computing subjects. Topics such as cloud architecture, virtualisation and storage technologies, and data centre fundamentals, as well as security and compliance in the cloud, are explored. This subject is heavily influenced by industry interaction, and includes hands-on labs and workshops using and comparing commonly found tools within the cloud infrastructure industry."
    },
    {
        "subject": "Innovation and Entrepreneurship Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42702.html",
        "description": null
    },
    {
        "subject": "Innovation Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42079.html",
        "description": "For further details, contact UTS: Information Technology."
    },
    {
        "subject": "Innovation Studio ",
        "link": "https://handbook.uts.edu.au/subjects/420048.html",
        "description": "The Innovation Studio focuses on a self-directed industry project approached independently by multi-disciplinary teams. Students will identify business problems, designing an approach to build a solution that meets stakeholder needs. They will critically evaluate and reflect on their process, and effectively communicate innovative outcomes. "
    },
    {
        "subject": "Innovations for Global Relationship Management ",
        "link": "https://handbook.uts.edu.au/subjects/31258.html",
        "description": "The computing industry in Australia has passed through a number of stages and is entering a phase where its pivotal role is using computers to maintain relationships, knowledge management and innovation. This has lead to competitive advantage becoming the most important goal. This subject places local IT industries firmly within the local and global economic context. The topics covered include: an overview of the global IT industry, including its direction and structure; the value of IT in business; implications of e-commerce, customer relationship and knowledge management, user modelling, outsourcing, and off-shoring; and legal issues in the new economy for formalising those relationships. The subject also looks at ways of organising business information in organisations, with a focus on informal flows found in organisations. Relationships differ in the kind of work undertaken, process followed in team formation and management. This subject covers relationship building by having students using tools such as portals for maintaining customer loyalty and outsourcing collaborations."
    },
    {
        "subject": "Interaction Design Studio ",
        "link": "https://handbook.uts.edu.au/subjects/95569.html",
        "description": null
    },
    {
        "subject": "Interaction Design Studio ",
        "link": "https://handbook.uts.edu.au/subjects/41021.html",
        "description": "This is a capstone project subject where students consolidate their knowledge, skills and experience acquired in their studies. This is realised in the planning, development and production of a digital media product in a collaborative learning environment of a multimedia production team. Students are encouraged to critically innovate and experiment in their development process in the context of addressing a particular need as well as making an original contribution to the field of multimedia. The subject also provides students with the opportunity to explore possibilities for future development of their digital media product and careers in the multimedia industry."
    },
    {
        "subject": "Interactive Media ",
        "link": "https://handbook.uts.edu.au/subjects/32027.html",
        "description": "Interactive media systems are becoming increasingly widespread and have the potential to provide more complex and engaging experiences for users in many domains, including games, the arts, data visualisation/sonification and business. This subject introduces the fundamental principles of interactive media and associated tools. Students use creative coding tools and techniques to design and develop interactive media systems which incorporate digital audio, images, animation and video. The focus is on the creation of systems which provide rich and engaging user experiences in practical, real-world contexts."
    },
    {
        "subject": "Interactive Media ",
        "link": "https://handbook.uts.edu.au/subjects/31080.html",
        "description": "Interactive media systems are becoming increasingly widespread and have the potential to provide more complex and engaging experiences for users in many domains, including games, the arts, data visualisation/sonification and business. This subject introduces the fundamental principles of interactive media and associated tools. Students use creative coding tools and techniques to design and develop interactive media systems which incorporate digital audio, images, animation and video. The focus is on the creation of systems which provide rich and engaging user experiences in practical, real-world contexts."
    },
    {
        "subject": "Internet Programming ",
        "link": "https://handbook.uts.edu.au/subjects/32516.html",
        "description": "This subject introduces students to the specifics of the World Wide Web (WWW) and internet-based programming. The evolution of the internet and its technical foundation is studied as well as basic techniques for presenting data, text and pictures on the WWW. The client/server paradigm is explored in detail, featuring website design and construction using DHTML (Dynamic Hypertext Markup Language), PHP (Hypertext Pre-processor), MySQL (back-end database), AJAX and JavaScript techniques. This subject provides a sound basis for understanding how the WWW functions, how to construct websites and how to write software for the WWW using scripting techniques."
    },
    {
        "subject": "Internetworking Project ",
        "link": "https://handbook.uts.edu.au/subjects/31261.html",
        "description": "This subject consolidates students' understanding of internetworking-related theoretical knowledge and its application to practical projects which fall under two major categories: 1. internetworking projects; and 2. internetworking applications projects. This subject also provides students with the opportunity to work collaboratively in a team environment through project specification, design, set-up and implementation. Information on how to enrol in this subject is available from the faculty's current student information."
    },
    {
        "subject": "Introduction to Agent Based Modelling ",
        "link": "https://handbook.uts.edu.au/subjects/42828.html",
        "description": "Complex systems abound. Their emergent characteristics result from an interaction of the system's elements. Just what emergent characteristics result from such interactions is very difficult, if not impossible, to predict for complex systems. Simulation modelling is one way to explore complex systems. In this microcredential, students learn how to construct and modify system models using Agent Based Modelling (ABM) or Agent Based Modelling and Simulation (ABMS)."
    },
    {
        "subject": "Introduction to Artificial Intelligence ",
        "link": "https://handbook.uts.edu.au/subjects/41040.html",
        "description": "This subject helps students develop good understanding of concepts and fundamental algorithm ideas of Artificial Intelligence (AI) in some areas: machine learning, computational intelligence, computer vision, knowledge representation and modelling (expert system), natural language processing, reasoning, and robotics. Through a series of workshops and hand-on laboratory experiments designated for specific AI technologies in the targeted areas, respectively, students develop competence in applying AI techniques for given tasks and ability to make good judgement on model/algorithm selection."
    },
    {
        "subject": "Introduction to Complex Systems ",
        "link": "https://handbook.uts.edu.au/subjects/42082.html",
        "description": "Through an introduction to complex systems and their characteristics, this subject allows the students to develop their knowledge and skills to deal with the so-called wicked problems they will encounter in practice, problems that do not lend themselves to 'solutions' but may allow some redress. Students will encounter and analyse complex systems and ways to cope with this complexity. This subject provides opportunities to students to assess the impacts of their interventions in such systems by considering the cultural, social, economic, institutional and technical aspects of these interventions."
    },
    {
        "subject": "Introduction to Complex Systems Modelling ",
        "link": "https://handbook.uts.edu.au/subjects/42826.html",
        "description": "This microcredential introduces learners to the notions of complexity and complex systems, and to the modelling of such systems. Complex systems have characteristics that make their behaviour very difficult, if not impossible, to predict. Certainly, traditional analytic approaches are not adequate in the realm of complex systems. Modelling and simulation offer a way to explore such systems. Such models provide a window through which we may study the behaviour of complex systems, and of the impacts our interventions into these systems may have. When we think about just how prevalent complex systems are – from naturally occurring ecological systems, climate systems through to social, financial, communications and transport systems, we can begin to appreciate the importance and significance of complex system models and simulations. This microcredential introduces learners to the essentials of modelling complex systems. There are many approaches that are popularly used for such modelling. This microcredential shows learners how to determine which approach may be more useful in a given situation. Students learn to look at a particular system and, through studying its characteristics, classify it. This is important when we are trying to model the system."
    },
    {
        "subject": "Introduction to Computational Intelligence ",
        "link": "https://handbook.uts.edu.au/subjects/41042.html",
        "description": "This subject will focus on fundamental concepts and algorithms of computational intelligence (CI) including fuzzy logic, neural networks and evolutionary computation. Students will engage in a series of assignments and hands-on experiments to solve real-life problems from scratch. Computational techniques will be introduced to demonstrate how the problems can be simulated by mathematical models. Students will learn how to tackle these issues by applying various CI algorithms; how to extract the knowledge from the model and how to evaluate the model performance and extracted knowledge. By doing this, students will be able to process data, use existing CI models effectively and design, develop and validate solutions to computational intelligence problems."
    },
    {
        "subject": "Introduction to Computer Game Design ",
        "link": "https://handbook.uts.edu.au/subjects/31262.html",
        "description": "Designing computer games is a challenging task. It is not as simple as just having an idea or jumping straight into coding or creating visual assets without a plan. A high-quality game design must be well structured and documented, carefully crafted for a specific target audience, communicated and negotiated with a team of other designers, scoped to be implementable by a given team of developers within time constraints, and evaluated and iterated on many times until a finely tuned game experience emerges. A professional game designer is an engineer of entertainment. Thus, in this subject, students will be taught the theoretical concepts and practical methodologies needed to ideate, communicate, implement, and improve upon your designs. In this way, students will learn to combine their existing software and game development skills with creativity and iterative design thinking to craft compelling interactions between players and the system of rules that govern them. Students will start by applying these theories and process to the creation of a physical board game prototype before moving on to creating a digital game in a popular game engine. This subject does not teach game development (e.g. coding or art asset creation) but instead requires students to self-learn what is needed to implement their group's shared vision. Students will adopt a kit-bashing approach to rapidly prototype and iterate on their game designs and playtest them with other students on a weekly basis to collect and analyse feedback. By the end of the session, students will have both a board game and digital game that are novel and refined, which can be used in future employment portfolios to highlight interaction design skills in entertainment domains."
    },
    {
        "subject": "Introduction to Computer Game Development ",
        "link": "https://handbook.uts.edu.au/subjects/31263.html",
        "description": "This subject introduces game development through the use of a commercial-grade game engine. It aims to build a generalizable understanding of the theory of virtual interactive simulations, while also more specifically developing intermediate competence in programmatic problem solving within the Unity Game Engine. The subject includes exposure to common terminology used in the industry, an introduction to the core interface tools of an engine, experience in applying vector and matrix mathematics to transform virtual objects in 2D and 3D coordinate space, and a strong focus on programming in games through the use of an engine API. This establishes the skills required to successfully contribute to the development of significant group projects found in many of the subsequent games related subjects. "
    },
    {
        "subject": "Introduction to Computer Graphics ",
        "link": "https://handbook.uts.edu.au/subjects/31264.html",
        "description": "This subject helps students develop problem-solving and communication skills in the context of computer graphics, including shape representation, manipulation and visualisation. It helps students enhance their skills to design and implement three-dimensional (3D) computer images, such as those used in animated films, virtual reality (VR), data visualisation and computer games. This subject aims to give students a balance of theory and practice, both of which are important to the understanding of and efficient development with computer graphics technology. Students learn fundamental principles of graphical pipelines and representations and put them into practice in the modern context of WebGL via the ThreeJS framework. By completing this subject, students gain valuable knowledge of the underlying graphical systems of game engines and 3D animation software, as well as skill in creating interactive 3D web applications that can be applied to a broad range of future studies and careers."
    },
    {
        "subject": "Introduction to Data Analytics ",
        "link": "https://handbook.uts.edu.au/subjects/31250.html",
        "description": "Data analytics is the art and science of turning large quantities of usually incomprehensive data into meaningful and commercially valuable information. It is the basis of modern computer analytics and intelligence. It includes a number of IT areas, such as statistical methods for identifying patterns in data and making inferences; database technologies for managing the data sets to be mined; a range of intelligent technologies that derive automatically patterns from data; and visualisation and other multimedia techniques that support human pattern discovery capabilities. This subject offers the foundations of data analytics, data mining and knowledge discovery methods and their application to practical problems. It brings together the state-of-the-art research and practical techniques in data analytics, providing students with the necessary knowledge and capacity to initiate and conduct data mining research and development projects, and professionally communicate with analytics experts."
    },
    {
        "subject": "Introduction to Human-centred Complex Systems ",
        "link": "https://handbook.uts.edu.au/subjects/41189.html",
        "description": "This subject introduces students to relevance and criticality of information systems to the study of complex systems in general and human-centred complex systems in particular. Students develop the necessary skills to enable them to observe an information system in any context as a human-centred, socio-technical complex system with consequences for different stakeholders (beyond the users of these systems). They also learn about system behaviour emergence, adaptive systems, holism, and other systems concepts in the context of information systems. Students acquire the mindset and skills to identify and cope with system complexity, underlying assumptions and consequences of these assumptions. Through collaborative classwork, they learn different systems modelling techniques (such as participatory modelling and agent-based modelling) with a clear understanding of the limitations and strengths of these modelling techniques in IS."
    },
    {
        "subject": "Introduction to Information Systems ",
        "link": "https://handbook.uts.edu.au/subjects/31266.html",
        "description": "This subject describes today's business environment and how technology is integrated into business, government and community systems. It covers the trends towards greater mobility, greater complexity, globalisation and business networking, and ways that technology can deliver services to improve business competitiveness in an increasingly global and networked environment. It describes the role of information systems (IS) for better business management and the formation of business networks. Real-world case studies are presented to understand the role of IS in obtaining and maintaining competitive advantage. This introductory subject explains activities used to develop, implement and maintain IS. Techniques for building effective team collaboration skills and relationship skills are demonstrated in this subject. In addition, ethics, privacy and information security are highlighted. In this subject, students learn to apply theoretical knowledge to solve practical situations, learn to generate new ideas and learn how to work together to develop team skills."
    },
    {
        "subject": "Introduction to Participatory Modelling ",
        "link": "https://handbook.uts.edu.au/subjects/42827.html",
        "description": "Participatory modelling (PM) is a powerful tool that combines collective knowledge of the stakeholders and interactive simulation modelling techniques to find better solutions for complex problems. Learning is a crucial component of participatory modelling because as the stakeholders exchange their perspectives, they learn from each other, which leads to the development of shared, more holistic understanding of the problem and, consequently, to more feasible solutions. In this microcredential, students learn how to engage with stakeholders, and how to avoid or overcome any pitfalls when using the techniques of Participatory Modelling."
    },
    {
        "subject": "Introduction to Quantum Computing ",
        "link": "https://handbook.uts.edu.au/subjects/41170.html",
        "description": "This subject introduces quantum computation, a model of computation based on the physical laws of quantum mechanics. Quantum computers outperform traditional computers for a range of practical problems, and in many cases offer drastic advantages. In this subject, students will learn about the basic tools for understanding quantum information processing. This knowledge will be applied to study the key quantum protocols: teleportation, superdense coding, and simple quantum algorithms. Students will be able to comprehend some of the key features of quantum theory which differentiate it from classical theory, including quantum entanglement and coherence."
    },
    {
        "subject": "Introduction to Software Development ",
        "link": "https://handbook.uts.edu.au/subjects/41025.html",
        "description": "This subject introduces students to the fundamentals of contemporary software development. An overview of the agile and non-agile software development principles, methods, tools and techniques is presented. Current trends and challenges in the practice of software development are explored. In this subject, students learn how to design, develop and evaluate software that implements commercially realistic but manageably small software requirements. Most often the task is to modify or extend some existing software feature or function but can also be to create new features or functions. Peer learning and collaboration are encouraged but, ultimately, each student must complete their tasks individually. The primary objective is that students experience, understand the importance of, and can apply sound professional practices of software development."
    },
    {
        "subject": "iOS Application Development ",
        "link": "https://handbook.uts.edu.au/subjects/42889.html",
        "description": "This subject is an introduction to iOS application development. Students learn the Swift programming language, the iOS development environment and explore the iOS app frameworks. The subject has an emphasis on giving students practical exposure to software development in the iOS environment."
    },
    {
        "subject": "IS Data Visualisation Studio ",
        "link": "https://handbook.uts.edu.au/subjects/41193.html",
        "description": "Taking the Information Systems (IS) perspective (rather than the more common Data Science or IT perspectives), this studio subject focuses on the latest developments and professional practices in data visualisation and visual analytics for non-technical decision-makers. Recognising the importance of data visualisation literacy in various disciplines including IS, the subject differs from other more common data visualisation subjects by emphasising (i) learning the whys behind doing data visualisation in addition to the how to dos, (ii) identifying business/organisational cases and their requirements, the stakeholders, and their problem space and decision-making needs, (iii) visual ethics and responsible use of visual data, and (iv) utilising commercial data visualisation software instead of elaborate coding. In short, the subject treats visualisation as a “verb” rather than a “noun” and aims for visual problem exploration “through data” rather than creation of static visual outputs. To this end, the subject is taught in a studio setting with a focus on design thinking exercises and ethical visual analytics. Students develop the necessary skills and the mindset for problem finding and solving through visual data exploration that goes beyond creation of static visual outputs. These skills include identification of different stakeholders and analysis of their decision-making needs and environments, problem formulation, finding and ethical harvesting of relevant data, data quality, data integration, multidimensional modelling, and development of a data exploration prototype using a commercial data visualisation software. Focusing on value creation and decision-making needs of different stakeholders, students also learn how to use data-driven visual storytelling and other contemporary techniques to explore the problem space, inform, influence and inspire different types of stakeholders (including business and IT)."
    },
    {
        "subject": "IS Graduate Project (Part 1 of 2) ",
        "link": "https://handbook.uts.edu.au/subjects/42088.html",
        "description": "Students undertake directed research that involves a substantial investigation independently under the supervision of a member of academic staff. Students apply research methods and approaches to solve significant problems taking an IS perspective. The subject is examined on the quality of research outcomes. In this first of two research project subjects, students will apply their research skills to produce a preliminary research report and an oral presentation."
    },
    {
        "subject": "IS Graduate Project (Part 2 of 2) ",
        "link": "https://handbook.uts.edu.au/subjects/42089.html",
        "description": "Students undertake directed research that involves a substantial investigation independently under the supervision of a member of academic staff. Students apply research methods and approaches to solve significant problems taking an IS perspective. The subject is examined on the quality of research outcomes, a written report, an oral presentation and management of the project work. In this second of two research project subjects, students will apply their research skills to produce an IS artefact. "
    },
    {
        "subject": "IS Implementation Studio ",
        "link": "https://handbook.uts.edu.au/subjects/41194.html",
        "description": "This is the first subject of a two-part studio allowing students to explore applications of information systems in more depth, through a combination of individual self-directed study and project work as a team. At this stage of the course, students should have solid IS foundations necessary for the 'applications studio', and therefore the studio is an opportunity for students to apply their IS knowledge and skills to a real-life problem. The theme of the 'applications studio' is for students to develop and apply IS skills while addressing a complex problem. Students work with mentors and facilitators throughout the session, and the individual tasks to be completed are guided by a learning contract established at the beginning of the studio."
    },
    {
        "subject": "IS Professional Capstone A ",
        "link": "https://handbook.uts.edu.au/subjects/41195.html",
        "description": "This is the first subject of a two-part IS Professional studio allowing students to develop professional skills in IS relating to their chosen career path. The studio is delivered through a combination of individual self-directed study and project work. In the 'professional studio', students develop IS knowledge and skills relating to their chosen stream of IS. Students work with mentors and facilitators throughout the session, and the individual tasks to be completed are guided by a learning contract established at the beginning of the studio."
    },
    {
        "subject": "IS Professional Capstone B ",
        "link": "https://handbook.uts.edu.au/subjects/41196.html",
        "description": "This is the second subject of the 'professional studio'. It allows students to continue developing professional skills in IS relating to their chosen career path. The studio is delivered through a combination of individual self-directed study and project work. In the 'professional studio', students develop IS knowledge and skills relating to their chosen stream of IS. Students work with mentors and facilitators throughout the session, and the individual tasks to be completed are guided by a learning contract established at the beginning of the studio."
    },
    {
        "subject": "IS Value Creation Studio ",
        "link": "https://handbook.uts.edu.au/subjects/41192.html",
        "description": "Students will create designs that satisfy an organisation’s values while maintaining relationships the deliver the best services to their clients and partners. To do this students will work collaboratively to identify ways to create value for society, and for organisations that make up society, in today’s dynamic complex environment. They will be provided with ways to identify problems in such environments and collaboratively design creative solutions that are technically proficient and aligned to people’s values. The students will encounter methods used to identify people’s needs by applying design thinking tools to find ways to reduce complexity into holistic parts that generate innovative solutions for each part to address these values. Students will identify information which is needed in decision making and then use it to collaborate to foster the creative designs."
    },
    {
        "subject": "IT Contracts and Outsourcing ",
        "link": "https://handbook.uts.edu.au/subjects/32990.html",
        "description": "This subject deals with the management, social, legal and financial issues that arise when several parties are involved in the development of an information system. Situations considered are outsourcing, insourcing, development partnerships, support relationships and individual contracting. Students are provided with sufficient resources to plan for and evaluate their position as a client or vendor, and to assess where they need professional advice."
    },
    {
        "subject": "IT Experience 1 ",
        "link": "https://handbook.uts.edu.au/subjects/31137.html",
        "description": "This subject involves formal planning and reflection, with students keeping track of their industry experiences. This is a zero-credit-point subject that supports students while they are working in industry for the purpose of gaining work experience."
    },
    {
        "subject": "IT Experience 2 ",
        "link": "https://handbook.uts.edu.au/subjects/31139.html",
        "description": "This subject involves formal planning and reflection, with students keeping track of their industry experiences. It is a zero-credit-point subject that supports students while they are working in industry for the purpose of gaining work experience."
    },
    {
        "subject": "IT Experience Reflection ",
        "link": "https://handbook.uts.edu.au/subjects/41065.html",
        "description": "This subject prepares students to enter the IT industry through the refinement of their professional understanding and insights from work integrated learning subjects 41071 through to 41074. Students also further develop their professional artefacts such as a public-facing portfolio, CV and self-presentation, in readiness for job applications. If students complete 41074 prior to the census date of a given session, they may enrol in this subject. Students who do not complete 41074 prior to the census date should postpone completion of this subject until they have completed 41074."
    },
    {
        "subject": "IT Graduate Project (24cp in one session) ",
        "link": "https://handbook.uts.edu.au/subjects/42286.html",
        "description": "For subject description, contact UTS: Information Technology."
    },
    {
        "subject": "IT Graduate Project 24cp (Part 1 of 2) (2x12cp) ",
        "link": "https://handbook.uts.edu.au/subjects/42282.html",
        "description": "For subject description, contact UTS: Information Technology."
    },
    {
        "subject": "IT Graduate Project 24cp (Part 2 of 2) (2x12cp) ",
        "link": "https://handbook.uts.edu.au/subjects/42283.html",
        "description": "For subject description, contact UTS: Information Technology."
    },
    {
        "subject": "IT Graduate Project 36cp (Part 1 of 2) (2x18cp) ",
        "link": "https://handbook.uts.edu.au/subjects/42284.html",
        "description": "For subject description, contact UTS: Information Technology."
    },
    {
        "subject": "IT Graduate Project 36cp (Part 2 of 2) (2x18cp) ",
        "link": "https://handbook.uts.edu.au/subjects/42285.html",
        "description": "For subject description, contact UTS: Information Technology."
    },
    {
        "subject": "IT Operations Management ",
        "link": "https://handbook.uts.edu.au/subjects/31097.html",
        "description": "This subject allows students to develop the knowledge and skills required for effective management of hardware, software and human resources within an information systems organisation. Major topics are resource acquisition, developing software, workplace environment, recruitment and training policies, hardware and software security, operations management and service level agreements, ITIL and cloud computing."
    },
    {
        "subject": "IT Professional and Society ",
        "link": "https://handbook.uts.edu.au/subjects/32563.html",
        "description": "This subject covers the body of ideas and commonly held principles that apply to professional standards and ethical behaviour in the information technology industry. The intent is to expose students to standards of professional behaviour and legal responsibility through case studies and current media-related articles featuring potential ethical and/or legal situations/dilemmas. It considers the history of information technology, the impact of information technology on society, the IT profession's codes of ethics and codes of conduct and the legal requirements pertaining to the information technology industry."
    },
    {
        "subject": "IT Professional Experience 1 ",
        "link": "https://handbook.uts.edu.au/subjects/41061.html",
        "description": "This subject supports students while they are working in industry or the community for the purpose of gaining professional experience in the practice of information technology. It provides students with the opportunity to carry out reflection on workplace culture and professional development. Since each individual student's work experience is different and IT is a diverse area, students are required to become active learners and take the initiative and responsibility to seek opportunities to fulfill the objectives of this experience subject. This subject can only be undertaken while on a faculty-approved internship. See the FEIT Professional Practice Program Forum on UTSOnline for requirements."
    },
    {
        "subject": "IT Professional Experience 2 ",
        "link": "https://handbook.uts.edu.au/subjects/41062.html",
        "description": "This subject supports students while they are working in industry or the community for the purpose of gaining professional experience in the practice of information technology. It provides students with the opportunity to carry out independent learning and professional development activities while on internship. Students develop a report on the learning they undertake during this subject. Since each individual student's work experience is different and IT is a diverse area, students are required to become active learners and take the initiative and responsibility to seek opportunities to fulfill the objectives of this experience subject. This subject can only be undertaken while on a faculty-approved internship. See the FEIT Professional Practice Program Forum on UTSOnline for requirements."
    },
    {
        "subject": "IT Professional Experience 3 ",
        "link": "https://handbook.uts.edu.au/subjects/41063.html",
        "description": "This subject supports students while they are working in industry or the community for the purpose of gaining professional experience in the practice of information technology. It provides students with the opportunity to carry out reflection on workplace culture and professional development. Because each individual student's work experience is different and IT is very diverse, students are required to become active learners and take the initiative and responsibility to seek opportunities to fulfill the objectives of this experience module. This subject provides some tools to support this learning. This subject can only be undertaken while on a faculty-approved internship. See the FEIT Professional Practice Program Forum on UTSOnline for requirements."
    },
    {
        "subject": "IT Professional Experience 4 ",
        "link": "https://handbook.uts.edu.au/subjects/41064.html",
        "description": "This subject supports students while they are working in industry or the community for the purpose of gaining professional experience in the practice of information technology. It provides students with the opportunity to carry out independent learning and professional development activities while on internship. Students develop a report on the learning they undertake during this subject. Because each individual student's work experience is different and IT is very diverse, students are required to become active learners and take the initiative and responsibility to seek opportunities to fulfill the objectives of this experience module. This subject provides some tools to support this learning. This subject can only be undertaken while on a faculty-approved internship. See the FEIT Professional Practice Program Forum on UTSOnline for requirements."
    },
    {
        "subject": " LANS and Routing ",
        "link": "https://handbook.uts.edu.au/subjects/32524.html",
        "description": "This subject provides students with knowledge of local area network (LAN) hardware and physical layer standards, and basic computer networking concepts and principles, and introduces LAN design and the use of routers and switches, and routing and switching in autonomous system intranets. It also explains how these access WANs. Using the Cisco Networking Academy's online resources and practical work in wiring and configuring LANs, including Cisco routers and switches, is an integral part of this subject."
    },
    {
        "subject": "Layout and Animation ",
        "link": "https://handbook.uts.edu.au/subjects/42917.html",
        "description": null
    },
    {
        "subject": "Leadership and People Management ",
        "link": "https://handbook.uts.edu.au/subjects/32553.html",
        "description": "This postgraduate subject explores the phenomenon of organisational leadership within a global knowledge economy dominated by a revolution in information and communication technology (ICT). Its focus is on the leadership practices that generate the intangible capital resources (ICRs) required for success in this knowledge economy; in particular those practices that build a social environment characterised by strong relationships and committed, focused endeavour. In the development and leveraging of these ICRs, and the relationships that generate them, critical practices around the management of power are identified and explored. Furthermore, the subject attempts to develop in students appropriate theoretical and conceptual frames of reference and knowledge bases for the mastery of such practices."
    },
    {
        "subject": "Leading Change and People ",
        "link": "https://handbook.uts.edu.au/subjects/42713.html",
        "description": null
    },
    {
        "subject": "Leading Organisational Change ",
        "link": "https://handbook.uts.edu.au/subjects/32561.html",
        "description": "This subject explores a set of fundamental concepts and models relating to leading and managing change in the evolving knowledge economy. Central themes include an understanding of core organisational process and structure, and the ways in which leaders can drive strategic change. The subject presents dilemmas in, and approaches to implementing change in real companies through a set of case studies. Students enhance their conceptual understanding of organisational change through a collaborative process involving participants, theory and industry practitioners. They apply this emergent understanding through the completion of a work-based change management project. This subject challenges students for higher management roles."
    },
    {
        "subject": " Machine Learning ",
        "link": "https://handbook.uts.edu.au/subjects/320513.html",
        "description": "Data analytics is an exciting new field combining databases, artificial intelligence, machine learning and visualisation, among others. It is applied in many fields of business, industry and science to discover new information and knowledge. Central to data analytics are the algorithms themselves. This subject builds on previous data analytics subjects to give an understanding of how basic as well as more powerful and subtle algorithms work. It takes a research-inspired approach so that students learn to apply state-of-the-art algorithms to their professional practice. It also introduces data analytics approaches for specific domains such as social network analysis and text mining."
    },
    {
        "subject": "Machine Learning ",
        "link": "https://handbook.uts.edu.au/subjects/31005.html",
        "description": "Machine learning is an exciting field studying of how intelligent agents can learn from and adapt to experience and how to realise such capacity on digital computers. It is applied in many fields of business, industry and science to discover new information and knowledge. At the heart of machine learning are the knowledge discovery algorithms. This subject builds on previous data analytics subjects to give an understanding of how both basic and more powerful algorithms work. It consists of both hands-on practice and fundamental theories. Students learn important techniques in the field by implementation and theoretical analysis. The subject also introduces practical applications of machine learning, especially in the field of artificial intelligence."
    },
    {
        "subject": "Machine Learning Foundations ",
        "link": "https://handbook.uts.edu.au/subjects/42820.html",
        "description": "This microcredential introduces the essential elements of machine learning - a technique that enables a machine to learn from data to automatically derive or enhance its strategy to perform its tasks. Taking a research-inspired approach, the microcredential guides learners to apply state-of-the-art algorithms to their professional practice with a focus on practical applications. The microcredential presents learners with core concepts in machine learning as well as a generic framework. Basic learning models, including decision trees and linear families, demonstrate the theory of machine learning. These models are also widely applied in real-world applications. "
    },
    {
        "subject": "Management Research Methods ",
        "link": "https://handbook.uts.edu.au/subjects/32930.html",
        "description": "This subject prepares students for research in organisations. The advantages and limitations of different research paradigms are examined as well as their applicability in different organisational contexts. Experience is provided in the design of research studies, in the analysis and interpretation of data, and in report presentation. Participants acquire skills that are useful in the conduct of research agendas in their own organisations and in the critical evaluation of others' research work."
    },
    {
        "subject": "Management Research Project ",
        "link": "https://handbook.uts.edu.au/subjects/32932.html",
        "description": "This subject is the compulsory part of the final master's project. Participants practise the methods and techniques introduced in the prerequisite subject by undertaking a research project."
    },
    {
        "subject": "Marketing Technology ",
        "link": "https://handbook.uts.edu.au/subjects/42905.html",
        "description": "This subject gives non-marketers, especially managers with a technical background, a new way of thinking about customers and their organisation. In this respect, it treats marketing as the process of accessing new customers and understanding their needs, thereby creating value for the organisation. This subject covers the fundamentals of marketing with special emphasis upon the marketing of technology and the way technology is changing the practice of marketing. The subject also challenges students to critically analyse the field of marketing's contribution to environmental sustainability and social change. After introducing essential marketing concepts, the subject relates these to technology industries, focusing on the way innovation in technology is changing marketing practice. Throughout the subject, participants are challenged to consider the wider socioeconomic and environmental impacts and challenges facing contemporary marketing practices."
    },
    {
        "subject": "Methods in Quantum Computing ",
        "link": "https://handbook.uts.edu.au/subjects/41076.html",
        "description": "Quantum computing is a disruptive new technology since quantum computers promise dramatic advantages over current computers. Recent rapid physical experimental progress has made it possible that large-scalable and functional quantum computers will be built within 10 years. This subject exposes and demystifies quantum computing using a step-by-step approach. It introduces systematically the basic principles of quantum computing, quantum algorithms and programming methodologies and techniques so that the students can develop software to realise the superpower of quantum computers."
    },
    {
        "subject": "Mobile Communications and Computing ",
        "link": "https://handbook.uts.edu.au/subjects/32118.html",
        "description": "This subject covers the development of the wireless network technology from cellular networks to IP wireless networks. The emphasis is on the concepts, infrastructure, and protocols for supporting device and user mobility. The subject also focuses on the development of a simple mobile application for small devices."
    },
    {
        "subject": "Mobile Networking ",
        "link": "https://handbook.uts.edu.au/subjects/31275.html",
        "description": "Wireless networks, such as cellular, WiFi, sensor, satellite and near field communication networks, provide ubiquitous connections to devices and end-users, and are the underlying technologies and systems for almost every industry today. This subject covers the principles and applications of wireless telecommunication networks, and their integration with the internet. The emphasis is on the concepts, infrastructure and protocols of these networks, and the use of these networks in applications with different requirements of supporting devices and mobility. This subject also offers extensive hands-on experience via solving industry-related problems, and provides opportunities for research innovation via group project work. This subject provides students with both fundamental knowledge and practical usage experience in wireless networks, and is suitable for students over a wide range of engineering courses."
    },
    {
        "subject": "Modelling for Complex Systems ",
        "link": "https://handbook.uts.edu.au/subjects/42085.html",
        "description": "In this subject students will gain an overview of the appropriateness and applicability of stakeholder analyses and modelling approaches to complex systems. A range of simulation tools and techniques will also be explored, and students will develop skills in applying modelling techniques such as Agent Based Modelling. Students will apply these tools and methods to complex systems in a variety of domains, such as health, transportation, energy, and the environment. Through this work, students will analyse complex system characteristics such as emergence, self-organisation and adaptability, and skilfully apply the methods to support decision making. "
    },
    {
        "subject": "Multilayer Switched Networks ",
        "link": "https://handbook.uts.edu.au/subjects/32011.html",
        "description": "This subject complements and extends the theory and practice learned by completing the prerequisites subjects. This subject extends skills and knowledge in the design and implementation of switched campus networks using VLANs for performance, reliability and security. Various methods regarding planning, configuring, and verifying the implementation of complex enterprise switching solutions are explored. Practical work is done on Cisco Systems layer 2 and layer 3 switches. The related topics are widely related to CCNA Routing and Switching: Connecting Networks and Scaling Networks and CCNP Switch. The subject is run in the UTS Cisco Systems Network Academy."
    },
    {
        "subject": " Natural Language Processing ",
        "link": "https://handbook.uts.edu.au/subjects/41043.html",
        "description": "Natural Language Processing (NLP) develops statistical techniques and algorithms to automatically process natural languages (such as English). It includes a number of AI areas, such as text understanding and summarization, machine translation, and sentiment analysis. This subject introduces the foundations of technologies in NLP and their application to practical problems. It brings together the state-of-the-art research and practical techniques in NLP, providing students with the knowledge and capacity to conduct NLP research and to develop NLP projects."
    },
    {
        "subject": "Network Management ",
        "link": "https://handbook.uts.edu.au/subjects/32528.html",
        "description": "This subject explains the role of the network manager and the network management system. It discusses the components of network management, i.e. fault management, performance management, configuration management, security management and accounting management. The integration of the components into an enterprise management system is addressed. The lecture material is integrated with laboratory sessions throughout, which allow students to experience aspects of network management."
    },
    {
        "subject": "Network Management ",
        "link": "https://handbook.uts.edu.au/subjects/31274.html",
        "description": "This subject explains the role of the network manager and the network management system. It discusses the components of network management, i.e. fault management, performance management, configuration management, security management and accounting management. The integration of the components into an enterprise management system is addressed. The lecture material is integrated with laboratory sessions throughout, which allows students to experience aspects of network management including the skills of using basic network management tools and application for network maintenance."
    },
    {
        "subject": "Network Security Appliances ",
        "link": "https://handbook.uts.edu.au/subjects/32310.html",
        "description": "This is a practice-based subject, using material based on the Cisco Network Security course. Learning is laboratory-based. The emphasis is on network security appliances, in particular:\r\n\nsecurity technologies, products and solutions\nfirewall and secure router design, installation, configuration and maintenance\nAAA implementation using routers and firewalls\nVPN implementation using routers and firewalls.\n"
    },
    {
        "subject": "Network Servers ",
        "link": "https://handbook.uts.edu.au/subjects/31338.html",
        "description": "Through this subject students gain an understanding of the design principles and implementation issues for the deployment of network servers based on Windows and Linux operating systems. Techniques and skills for system administration are developed through a comprehensive sequence of laboratory activities in combination with mini-lectures and design tasks."
    },
    {
        "subject": "Networked Enterprise Architecture ",
        "link": "https://handbook.uts.edu.au/subjects/31276.html",
        "description": "Organisations in Australia and around the world are increasingly recognising that they do not operate in isolation and that competitive advantage depends on business networks. The IT-business alignment has been the major challenge as organisations go through the transformation that keeps them competitive and agile. Employing successful enterprise architecture ensures that changes to the business process are correctly supported by information systems and their underlying IT infrastructure. This undergraduate subject introduces ways in which information systems can support business networking, focusing on sharing information and integrating business activities with business partners. Students learn enterprise architecture methodologies and gain an understanding of the tools and techniques for the design of business. Through case studies, this subject reinforces material provided in lectures and tutorials, and additional research while giving students scope to enhance their problem-solving, critical thinking and organisational skills. The subject stresses the development and assessment of real-world experience through applied and innovative tasks and with the team effort. Students develop the knowledge and skills required for using and managing information within an organisation."
    },
    {
        "subject": " Organisational Leadership ",
        "link": "https://handbook.uts.edu.au/subjects/42714.html",
        "description": null
    },
    {
        "subject": " PhD Thesis: Analytics ",
        "link": "https://handbook.uts.edu.au/subjects/32903.html",
        "description": "This subject is used for administrative purposes only. Students are enrolled in this subject while undertaking research towards the completion of their thesis."
    },
    {
        "subject": "PhD Thesis: Computer Systems ",
        "link": "https://handbook.uts.edu.au/subjects/33875.html",
        "description": "This subject is used for administrative purposes only. Students are enrolled in this subject while undertaking research towards the completion of their thesis."
    },
    {
        "subject": "PhD Thesis: Information Systems ",
        "link": "https://handbook.uts.edu.au/subjects/32986.html",
        "description": "This subject is used for administrative purposes only. Students are enrolled in this subject while undertaking research towards the completion of their thesis."
    },
    {
        "subject": "PhD Thesis: Software Engineering ",
        "link": "https://handbook.uts.edu.au/subjects/33874.html",
        "description": "This subject is used for administrative purposes only. Students are enrolled in this subject while undertaking research towards the completion of their thesis."
    },
    {
        "subject": "Pre-Visualisation ",
        "link": "https://handbook.uts.edu.au/subjects/42915.html",
        "description": null
    },
    {
        "subject": "Preparation for and Review of IT Experience ",
        "link": "https://handbook.uts.edu.au/subjects/31136.html",
        "description": "This subject involves formal planning of and regular reporting on work experience undertaken in 31137 IT Experience 1. There is particular emphasis on the skills students aim to gain."
    },
    {
        "subject": "Privacy Preserving ",
        "link": "https://handbook.uts.edu.au/subjects/41183.html",
        "description": "This subject introduces students to the techniques for ensuring data privacy, while allowing organizations to collect, store, analyse, and share personal or confidential data. Various privacy models can be used to develop techniques to develop defences against privacy attacks. Data anonymization and other statistical approaches to privacy and differential privacy are explored. "
    },
    {
        "subject": "Professional IT Practice Preparation 1 ",
        "link": "https://handbook.uts.edu.au/subjects/41115.html",
        "description": "This preparatory subject prepares students to enter a workplace as an intern. It includes Business Ethics, Code of Conduct, and Work, Health and Safety. The subject also introduces reflective practice so that students can begin to engage in a process of conscious learning in terms of their own professional practices."
    },
    {
        "subject": "Professional IT Practice Preparation 2 ",
        "link": "https://handbook.uts.edu.au/subjects/41116.html",
        "description": "The aim of this subject is to enable students to understand the culture of the IT workplace, to identify work opportunities, to effectively market themselves to appropriate employers and to develop professional skills and behaviours sought by employers that enable students to transition effectively into the IT workplace. The subject provides an introduction to skills (both technical and transferable) required to undertake professional practice by teaching students how to manage ethical dilemmas, apply creativity in the workplace and learn experientially using a formal framework. The subject also introduces a skills-based e-portfolio, which students will employ during their internships and for ongoing careers management. "
    },
    {
        "subject": "Professional Learning Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42700.html",
        "description": "This subject uses a practical, studio-based learning approach where the challenge is for students to situate themselves in the context of the future of work. The studio equips each student with design skills (ideating, researching, validating and testing potential solutions) required to plan their own professional learning and development, while preparing to tackle complex problems in their organisation or in their planned future career directions. The focus of this studio is the design of their own, and critique of peers’, professional learning plans. Students work collaboratively and learn to provide constructive feedback."
    },
    {
        "subject": "Professional Practice in Australian Context ",
        "link": "https://handbook.uts.edu.au/subjects/43005.html",
        "description": "This subject provides students with opportunities to investigate some of the dimensions of professional engineering or IT practice in the Australian Context. Students will be encouraged to identify what capabilities they will need to develop in order to work in the Engineering or IT professions in Australia. Students will prepare a communication success plan to prepare themselves for professional environments. Students will observe workplace communication practices and simulate the professional communication they observe."
    },
    {
        "subject": "Programming 1 ",
        "link": "https://handbook.uts.edu.au/subjects/41039.html",
        "description": "Programming computers is an essential skill for computer scientists, software engineers, software developers and data scientists, and successful programmers integrate many diverse capabilities to be able to solve complex, abstract problems. This subject introduces the core programming concepts using an object-oriented approach to programming, prioritising project-based learning and independent research, experimentation, and communication skills. Additionally, most programming in industry occurs as alterations to a portion of a large existing codebase, and this subject introduces students to how their initial programming explorations may eventually expand to making fixes or improvements to complex industry-scale projects."
    },
    {
        "subject": "Programming on the Internet ",
        "link": "https://handbook.uts.edu.au/subjects/31748.html",
        "description": "This subject introduces students to the specifics of the World Wide Web (WWW) and internet-based programming. The evolution of the internet and its technical foundation is studied as well as basic techniques for presenting data, text and pictures on the WWW. The subject focuses on PHP (hypertext preprocessor), MySQL (backend database), JavaScript, AJAX, XML and Object Oriented PHP. This subject provides a sound basis for understanding how the WWW functions, how to construct websites and how to write software for the WWW using advanced scripting techniques."
    },
    {
        "subject": "Project ",
        "link": "https://handbook.uts.edu.au/subjects/31030.html",
        "description": "This subject is intended to give students experience in working independently on a small research or development project. The project may be drawn from any area of information technology or may be part of a multidisciplinary project such as those managed by UTS Shopfront. Students work on the project independently under the supervision of an academic staff member."
    },
    {
        "subject": "Project ",
        "link": "https://handbook.uts.edu.au/subjects/31352.html",
        "description": "For further details, contact UTS: Information Technology."
    },
    {
        "subject": "Project ",
        "link": "https://handbook.uts.edu.au/subjects/31029.html",
        "description": "This subject is intended to give students experience in working independently on a small research or development project. The project may be drawn from any area of information technology or may be part of a multidisciplinary project such as those managed by UTS Shopfront. Students can work on a project individually or in a small group. Each project is supervised by a member of academic staff."
    },
    {
        "subject": "Project ",
        "link": "https://handbook.uts.edu.au/subjects/31028.html",
        "description": "This subject is intended to give students experience in working independently on a small research or development project. The project may be drawn from any area of information technology or may be part of a multidisciplinary project such as those managed by UTS Shopfront. Students can work on a project individually or in a small group. Each project is supervised by a member of academic staff."
    },
    {
        "subject": "Project Management ",
        "link": "https://handbook.uts.edu.au/subjects/32541.html",
        "description": "This postgraduate subject covers the management of the development and implementation of information technology solutions, with particular emphasis on information systems, project management and contemporary issues in the delivery of information technology solutions to business. It considers the role of project management in business and identifies the managerial control and reporting aspects necessary from inception to implementation of a development project."
    },
    {
        "subject": "Project Management and the Professional ",
        "link": "https://handbook.uts.edu.au/subjects/31272.html",
        "description": "This subject covers managing development and implementation of project solutions with an emphasis on information systems project management and professionalism. It considers the roles of project managers, practitioners and stakeholders within a project team; ethics and codes of conduct; organisational context of projects; and different knowledge areas contributing to the successful delivery of a project life cycle."
    },
    {
        "subject": "Prototyping Design and Systems Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42040.html",
        "description": null
    },
    {
        "subject": "Prototyping Physical Interaction ",
        "link": "https://handbook.uts.edu.au/subjects/41019.html",
        "description": "This subject focuses on the design, assessment and implementation of effective and elegant interactive physical devices. Students use a human-centred design approach to create, iteratively evaluate, and refine a series of prototype devices which use a variety of sensors, actuators and display methods to facilitate rich and complex user interactions and experiences. Students learn how to obtain and process data from sensors, and design the auditory, visual and haptic feedback that the prototype provides. By conducting iterative cycles of user assessment and feedback on the evolving prototype interactive system, students iteratively refine and finalise their prototype design."
    },
    {
        "subject": "Prototyping Physical Interaction ",
        "link": "https://handbook.uts.edu.au/subjects/42070.html",
        "description": "This subject focuses on the design, assessment and implementation of effective and elegant interactive physical devices. Students use a human-centred design approach to create, iteratively evaluate, and refine a series of prototype devices which use a variety of sensors, actuators and display methods to facilitate rich and complex user interactions and experiences. Students learn how to obtain and process data from sensors, and design the auditory, visual and haptic feedback that the prototype provides. By conducting iterative cycles of user assessment and feedback on the evolving prototype interactive system, students iteratively refine and finalise their prototype design."
    },
    {
        "subject": " Quantum Algorithms ",
        "link": "https://handbook.uts.edu.au/subjects/41174.html",
        "description": "Students will develop an understanding of the most famous quantum algorithms, including Shor’s efficient quantum algorithm for integer factorisation and Grover’s search algorithm. Students will also be introduced to algorithms based on quantum walks, an analog of random walks, algorithms for simulating quantum systems, and quantum algorithms for solving systems of linear equations. Further applications of these algorithms to optimisation and machine learning will be discussed. "
    },
    {
        "subject": "Quantum Computer Architectures ",
        "link": "https://handbook.uts.edu.au/subjects/41171.html",
        "description": "Quantum computers gain an exponential advantage over classical devices because their processors are built from quantum mechanical systems. The development of quantum architectures is a highly interdisciplinary topic, merging aspects of physics, information theory, computer science, and control theory. In this subject, students will learn the theory of how quantum processors work, the different approaches taken to building quantum processors, and the techniques utilized for the control and characterization of quantum computers."
    },
    {
        "subject": "Quantum Information Theory ",
        "link": "https://handbook.uts.edu.au/subjects/41172.html",
        "description": "In this subject, students will develop advanced capability in the core concepts of Quantum Information Theory. Quantum Information Theory is the quantum generalization of Information Theory and provides the mathematical language underpinning quantum computing and information science. In this subject, students will learn about entropy, entanglement, and the uncertainty principle, and how they can be used for secure communication, and eventually a novel 'quantum' internet. Along the way the students will become familiar with different advanced mathematical techniques that are important in all areas of quantum information theory."
    },
    {
        "subject": "Quantum Software and Programming ",
        "link": "https://handbook.uts.edu.au/subjects/41173.html",
        "description": "Many quantum software tools exist and are emerging the quantum technology ecosystem. In this subject, students will learn how to use these tools and relate them to core concepts in quantum computing by developing working modules. Basic notions will be implemented in tutorials and students will develop a live module implementing an advanced quantum algorithm. "
    },
    {
        "subject": " Research Project ",
        "link": "https://handbook.uts.edu.au/subjects/32933.html",
        "description": "Students undertake research projects that involve a substantial investigation individually or in a team of three people, under the supervision of a member of academic staff or a supervision panel consisting of a member of academic staff and a senior PhD candidate. Students apply research methods and approaches to solve new problems using ICT technologies. The subject is examined on the quality of research outcomes, a written report and an oral presentation."
    },
    {
        "subject": "Research Project ",
        "link": "https://handbook.uts.edu.au/subjects/32934.html",
        "description": "Students undertake research that involves a substantial investigation independently under the supervision of a member of academic staff. Students apply research methods and approaches to solve significant problems using ICT technologies. The subject is examined on the quality of research outcomes, a written report, an oral presentation and management of the project work."
    },
    {
        "subject": "Review of IT Experience ",
        "link": "https://handbook.uts.edu.au/subjects/31138.html",
        "description": "This subject involves formal planning of and regular reporting on work experience undertaken in 31139 IT Experience 1. There is particular emphasis on the skills students hope to gain."
    },
    {
        "subject": "Routing and Switching Essentials ",
        "link": "https://handbook.uts.edu.au/subjects/31277.html",
        "description": "This subject extends the work done in the prerequisite subject. Students will have the opportunity to both develop sound knowledge and skills to pursue a networking specialisation or to develop a clear model of how networks can impact network-based applications. Students learn the role of routing protocols and how to compare them; how to design construct and implement small to medium-sized intranets; and how to perform basic management and security tasks. The role of TCP/IP, ICMP and other protocols in IP networks are evaluated. Students also learn how CISCO routers and switches are used for the practical work."
    },
    {
        "subject": " SAS Predictive Business Analytics ",
        "link": "https://handbook.uts.edu.au/subjects/42050.html",
        "description": "Predictive business analytics is used to predict unknown future events by analysing historical business data and plays a critical function in data-driven business. This subject covers the theoretical foundations of predictive business analytics. A series of demonstrations and exercises are used to reinforce concepts and analytical approaches to solving business problems. Students engage with case studies to guide them through all steps of the predictive analytical life cycle, from problem understanding to model deployment, through data preparation, feature selection, model training and validation, and model assessment. Model Studio is the pipeline flow interface in SAS Viya that enables students to prepare, develop, compare, and deploy advanced analytics models. Students learn to develop and train supervised machine learning models to make better decisions using big data. The SAS applications used in this course make machine learning and predictive analytics possible with a limited amount of programming or coding. Upon completion, students are prepared to sit the optional SAS certification exam, “SAS Certified Specialist: Machine Learning Using SAS Viya”."
    },
    {
        "subject": "Secure Programming and Penetration Testing ",
        "link": "https://handbook.uts.edu.au/subjects/41184.html",
        "description": "This subject introduces secure programming and penetration testing techniques to students. Students solve problems in ethical hacking by performing cyber-attacks to machines and applications with certain security vulnerabilities. Students also have opportunity to participate in security challenges and competitions at the national and international levels. Students are assessed on the basis of their technical capabilities in secure programming and penetration testing, their communication skills in speaking and writing, their team-working skills and awareness of ethical and legal constraints."
    },
    {
        "subject": "Short Course Module A ",
        "link": "https://handbook.uts.edu.au/subjects/42077.html",
        "description": "For further details, contact UTS: Information Technology."
    },
    {
        "subject": "Short Course Module B ",
        "link": "https://handbook.uts.edu.au/subjects/42078.html",
        "description": "For further details, contact UTS: Information Technology."
    },
    {
        "subject": "Social and Information Network Analysis ",
        "link": "https://handbook.uts.edu.au/subjects/42913.html",
        "description": "In social and economic lives, everything (e.g. people, information, business, events) is becoming more and more connected with the development of technologies such as social networks (e.g. Facebook, Twitter) and information networks (e.g. the Web). A practical way of making sense of these types of data is to analyse them as networks. This subject introduces the students to basic concepts in social and information networks, metrics to characterise networks, models to explain the generation of networks, and methods to analyse networks. The students learn to use software tools to visualise and analyse real-world network data. The subject also introduces a wide variety of applications in social and information networks such as user recommendation and web search."
    },
    {
        "subject": "Social Impact of IS Studio ",
        "link": "https://handbook.uts.edu.au/subjects/41186.html",
        "description": "This is the second subject of the 'applications studio'. It allows students to continue exploring applications of IS through a combination of individual self-directed study and project work as a team. The theme of the 'applications studio' is ‘Social impact of IS’. Students are expected to develop a suitable project and apply professional IS skills while addressing a complex problem. Students work with mentors and facilitators throughout the session, and the individual tasks to be completed are guided by a learning contract established at the beginning of the studio."
    },
    {
        "subject": "Software Development Studio 1 ",
        "link": "https://handbook.uts.edu.au/subjects/41113.html",
        "description": "This studio subject focuses on aspects of practical software development. The overall aim of this studio is to provide a rich and attractive practice-based learning environment for software development students to deeply learn and become professionally competent. To realise these aims the studio focuses on the methods of reflective design practice, teamwork, mentoring, and deep learning techniques, including immersion in difficult problems within a complex environment. The subject allows students to move towards senior roles in teams, expects students to become accomplished in reflection, and demonstrate application of software development skills, with an accent on design."
    },
    {
        "subject": "Software Development Studio 2 ",
        "link": "https://handbook.uts.edu.au/subjects/41114.html",
        "description": "This studio subject focuses on aspects of practical software development. The overall aim of this studio is to provide a rich and attractive practice-based learning environment for software development students to deeply learn and become professionally competent. To realise these aims the studio focuses on the methods of reflective design practice, teamwork, mentoring, and deep learning techniques, including immersion in difficult problems within a complex environment. The subject allows students to move towards senior roles in teams, expects students to become accomplished in reflection, and demonstrate application of software development skills, with an accent on design."
    },
    {
        "subject": "Story Development ",
        "link": "https://handbook.uts.edu.au/subjects/42914.html",
        "description": null
    },
    {
        "subject": "Storytelling and Sense-making Studio ",
        "link": "https://handbook.uts.edu.au/subjects/95563.html",
        "description": "This subject examines the nature of the interactive Data Story telling development process. It explores data arts creation process supported by Data Visualisation, story telling, and Sense-making. Students work on data arts project in a collaborative environment. This is an 'action learning' subject where students learn by doing. It has an intensive workload."
    },
    {
        "subject": "Strategic Business Management ",
        "link": "https://handbook.uts.edu.au/subjects/32562.html",
        "description": "Focused on creating sustainable value, strategic management practice is fundamental to the survival and growth of an organisation. It is not only the core concern of the organisation's executive leadership team, but also requires coherent execution by all members of the organisation. This subject examines the theories and practices of strategic business management. It explores emerging theories and frameworks that interlink strategy, innovation and leadership to achieve sustainable competitive advantage and organisational growth in the face of continuous environmental change."
    },
    {
        "subject": "Strategic Finance ",
        "link": "https://handbook.uts.edu.au/subjects/42016.html",
        "description": "This subject gives non-financial managers, especially managers with a technical background, a new way of thinking about measuring and influencing value in their organisation. It covers the fundamentals of finance within the context of technology and the way technology is changing the practice of value creation. A core theme of the subject is the integration of leadership, strategy and finance in driving success in modern technology companies. The subject provides an introduction to the theories and practical requirements of business planning, raising capital, investment decisions and managing growth within technology companies. In addition, the subject introduces students to the principles valuing technology projects, new product launches, acquisitions and ultimately technology companies. After introducing essential concepts of measuring value through the financial statements, the subject relates these to technology industries, focusing on the way innovation in technology is reflected in financial ratios. The subject also examines the drivers of value for technology businesses and allows students to explore strategies and tactics that maximise value for shareholders. Drivers of value include an understanding of price, volume and margins from an income statement perspective and working capital management from a balance sheet perspective. The subject also challenges students to evaluate the optimal funding mix for technology projects and companies and assess optimal capital structure. This includes a critical analysis of the risk/reward relationship between raising equity or debt for large projects."
    },
    {
        "subject": "Strategic IT Project ",
        "link": "https://handbook.uts.edu.au/subjects/31280.html",
        "description": "This subject deals with issues involved in strategic level analysis and design in a corporate information systems environment. Through a major case study, it reinforces material previously studied, while giving groups of students scope to use their own judgement in applying their knowledge. It stresses the development and assessment of alternative approaches to a system strategy. Senior management and communication skills are also developed."
    },
    {
        "subject": "Strategic Leadership for Innovation ",
        "link": "https://handbook.uts.edu.au/subjects/32005.html",
        "description": "This subject locates organisational leadership practices within a global business context dominated by a revolution in information and communication technology (ICT). Furthermore, it outlines various potential strategic inflection points facing contemporary Australian organisations and suggests leadership practices through which these can be anticipated and addressed effectively. In particular, it advocates strategic leadership practices that adopt innovation as a competitive strategy in response to the challenges of this era."
    },
    {
        "subject": "Studio 1 Project ",
        "link": "https://handbook.uts.edu.au/subjects/42083.html",
        "description": "This IS studio subject enables students to develop professional and research skills in IS relating to their chosen career path. The studio is delivered through a combination of self-directed study and group project work. In the studio, students will develop IS knowledge and skills relating to their chosen stream of IS. Students work with mentors and facilitators throughout the session, and the individual tasks to be completed are guided by a learning contract established at the beginning of the studio. "
    },
    {
        "subject": "Studio 2 Project ",
        "link": "https://handbook.uts.edu.au/subjects/42084.html",
        "description": "This IS studio subject enables students to continue developing professional and research skills in IS relating to their chosen career path. The studio is delivered through a combination of self-directed study and group project work. In the studio, students will develop IS knowledge and skills relating to their chosen stream of IS. Students work with mentors and facilitators throughout the session, and the individual tasks to be completed are guided by a learning contract established at the beginning of the studio. "
    },
    {
        "subject": "Studio 3: Innovation ",
        "link": "https://handbook.uts.edu.au/subjects/42048.html",
        "description": "The Innovation Studio focuses on a self-directed industry project approached independently by multi-disciplinary teams. Students will identify business problems, designing an approach to build a solution that meets stakeholder needs. They will critically evaluate and reflect on their process, and effectively communicate innovative outcomes. "
    },
    {
        "subject": "Sustainability and Information Systems ",
        "link": "https://handbook.uts.edu.au/subjects/42900.html",
        "description": "This subject explores the rising and complex challenges affecting organisational sustainability in the 21st century. Sustainability here is viewed from multidimensional perspectives to encompass environmental, technological, social, and economic sustainability of contemporary organisations and their operations. To achieve sustainability objectives, collaboration among a wide range of stakeholders, often mediated through the use of information technologies and collaborative media, is essential. This however poses significant and often existential challenges to many organisations attempting to apply traditional, structured, and short-term approaches in their operations, as well as considerable opportunities for innovative, collaborative, technology savvy, and long-term focused organisations. Consequently, the subject invites students to proactively and innovatively reflect on these issues and their effect on organisational leadership and management. In such reflection, students are encouraged to consider various real and hypothetical case-based scenarios, where they identify and evaluate challenges to sustainability, and recommend informed, innovative, collaborative, and rigorously supported arguments and policy initiatives."
    },
    {
        "subject": "Sustainability and Information Systems ",
        "link": "https://handbook.uts.edu.au/subjects/41190.html",
        "description": "This subject explores the rising and complex challenges affecting organisational sustainability in the 21st century. Sustainability here is viewed from multidimensional perspectives to encompass environmental, technological, social, and economic sustainability of contemporary organisations and their operations. To achieve sustainability objectives, collaboration among a wide range of stakeholders, often mediated through the use of information technologies and collaborative media, is essential. This, however, poses significant and often existential challenges to many organisations attempting to apply traditional, structured, and short-term approaches in their operations, as well as considerable opportunities for innovative, collaborative, technology savvy, and long-term focused organisations. Consequently, the subject invites students to proactively and innovatively reflect on these issues and their effect on organisational leadership and management. In such reflection, students are encouraged to consider various real and hypothetical case-based scenarios, where they identify and evaluate challenges to sustainability, and recommend informed, innovative, collaborative, and rigorously supported arguments and policy initiatives."
    },
    {
        "subject": "Sustainable Judgements ",
        "link": "https://handbook.uts.edu.au/subjects/42715.html",
        "description": null
    },
    {
        "subject": "System Security ",
        "link": "https://handbook.uts.edu.au/subjects/41182.html",
        "description": "This subject covers modern system security concepts, strategies, and techniques. Students develop practical and working tactics to achieve digital security in operation systems, databases and servers in various aspects. Students apply security measures and principles by design, implementation, and configurations crossing the systems. Students can enforce the system security and privacy by exploring the framework of system security and safety principles and guidelines, and utilizing various tools. This subject cover mechanisms and prominent techniques of system hardening. Students perform system hardening approaches in practical sessions, and can test the students’ hardened system with various attacks."
    },
    {
        "subject": "System Thinking ",
        "link": "https://handbook.uts.edu.au/subjects/42716.html",
        "description": null
    },
    {
        "subject": "Systems Administration ",
        "link": "https://handbook.uts.edu.au/subjects/32520.html",
        "description": "Through this subject students gain an understanding of the design principles and implementation issues for the deployment of network servers based on Windows and Linux operating systems. Techniques and skills for system administration are developed through a comprehensive sequence of laboratory activities in combination with mini-lectures and design tasks."
    },
    {
        "subject": "Systems Development Methodologies ",
        "link": "https://handbook.uts.edu.au/subjects/42087.html",
        "description": "In this subject students will learn a number of contemporary systematic approaches for developing information systems and evaluate their strengths and weaknesses. They will develop skills to identify and assess the appropriate process models and methods, taking into account all stakeholders including clients, developers themselves and their respective organisational contexts. Students will apply these skills in the context of managing information systems projects. "
    },
    {
        "subject": "Systems Quality Management ",
        "link": "https://handbook.uts.edu.au/subjects/32603.html",
        "description": "As products and the methods of producing them become more complex, organisations need methods of ensuring that their products are as intended. This subject teaches how to plan, implement and improve quality management processes, and how such systems are common to almost every organisation. Software and systems products are often complex and increasingly part of life critical systems, with matching demands on their development methods and quality management. This subject reviews how quality management systems are an integral part of organisation management, how quality management systems are spread through the different layers of organisations, and how such systems operate. Real-world examples are used throughout the subject to examine aspects of quality management systems, culminating in an industry-based project to devise an improvement to solve a quality management system problem."
    },
    {
        "subject": "Systems Testing and Quality Management ",
        "link": "https://handbook.uts.edu.au/subjects/31282.html",
        "description": "This subject provides students with the practical knowledge and skills that are necessary to effectively measure and control the quality of software products. It covers software quality assurance and management principles and practice together with systems and software testing approaches."
    },
    {
        "subject": " Technology Disruptors Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42030.html",
        "description": "This subject uses a practical, studio-based learning approach where the challenge is for students to situate themselves in the context of the technology trends and disruptors shaping work. The studio uses a practical, studio-based learning approach that equips each student with the design skills (ideating, researching, validating and testing potential solutions) required to plan their own professional learning and development, while preparing to tackle complex problems in their organisation or in their planned future career directions. The focus of this studio is the design of their own, and critique of peers’, professional learning plans. Students work collaboratively learning to provide constructive feedback. "
    },
    {
        "subject": "Technology Research Methods ",
        "link": "https://handbook.uts.edu.au/subjects/32931.html",
        "description": "This subject familiarises students with a range of skills and methods that are beneficial in carrying out research projects, with an emphasis on student-directed study. Students have the opportunity to study the advantages and limitations of different research approaches, as well as their applicability in different research contexts. They also have the opportunity to gain professional skills and advanced technical skills relevant to their research agenda, and in the critical evaluation of others' research work."
    },
    {
        "subject": "Technology Research Preparation ",
        "link": "https://handbook.uts.edu.au/subjects/32144.html",
        "description": "This subject provides postgraduate technology students with professional communication skills appropriate to their course. The subject begins with the techniques necessary to develop a literature review and professional ethics is taught in the research context. Students produce a project proposal, suitable for implementation in 32933 Research Project."
    },
    {
        "subject": "The Challenge Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42911.html",
        "description": "In Studio 3, participants work together to complete the animation project developed in Studio 1 (42909 The Connected Studio) to the highest professional standards. In addition to this, they develop a selected emerging visualisation technology project from Studio 2 (42910 The Collaboration Studio) as a high-fidelity prototype. The cohort responds to both assigned briefs in a professional environment, taking advantage of their team's strengths to produce high-quality outcomes. The team apply rigorous design and production techniques to complete innovative and creative responses to the posed challenges, stretching their craft and technical practices beyond what can be achieved individually. At various stages, the cohort critically examine and evaluate their evolving solutions, drawing on feedback from all relevant stakeholders, and respond appropriately to ensure that what is delivered is effective, innovative and has the highest production values."
    },
    {
        "subject": "The Collaboration Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42910.html",
        "description": "In this studio, participants use animation and visual effects techniques in innovative ways and engage with emergent visualisation technologies. In the process, they extend their skills in critical thinking and collaborative problem solving for professional practice. The Academy cohort explores approaches that optimise existing processes, prototype new methodologies and identifies opportunities to creatively and productively disrupt standard ways of working. Within a professional studio environment, they explore a range of emerging areas that can range from big data science and visualisation to augmented, virtual and mixed reality. They consider and examine ideas from a range of disciplines, develop and test multiple workflows and put them into practice to produce well-developed concepts. Studio hours are set to 35 hours a week to mirror the work practices, procedures and standards of a professional digital studio."
    },
    {
        "subject": "The Connected Studio ",
        "link": "https://handbook.uts.edu.au/subjects/42909.html",
        "description": "Participants are challenged to expand their craft and technical practices in this studio led by creative and technical supervisors drawn from industry. It mirrors the work practices, procedures and standards of a professional digital studio. Structured in crew roles, participants undertake industry-standard creative briefs and work across the disciplines of:  story (storyboards, editing, pre-visualisation) art (concept art, graphic design, character design, environment design, prop design) assets (modelling, surfacing, digital matte painting) performance (rigging, animation, camera, layout, effects (FX), crowd systems) visual (lighting, compositing) technical management project management creative management.  The multidisciplinary knowledge bases that inform this studio are supported by masterclass sessions and intensive mentoring by industry and academic experts. Academy members are required to engage in collaborative problem-solving and active knowledge-sharing as a dynamic process in a production environment."
    },
    {
        "subject": "Theory of Computing Science ",
        "link": "https://handbook.uts.edu.au/subjects/41080.html",
        "description": "This subject introduces the theory of computation, including topics from the theories of automata, rewriting, and parsing. Students learn to compute orders of complexity for various practical problems. An understanding of computational complexity can lead to the design of economical and feasible products and services. For example, for an online taxi service, strategically simplifying the computation can dramatically reduce the cost of solving the very large-scale passenger-driver matching problem. Similarly, mastering the fundamental theory of computation enables one to construct security schemes that are both convenient for users and tough against attackers. Also, in programming, the knowledge of how high-level statements are translated into operational instructions helps one identify performance bottlenecks to achieve optimal efficiency by appropriate design of the algorithm."
    },
    {
        "subject": "Thesis (Analytics) ",
        "link": "https://handbook.uts.edu.au/subjects/31676.html",
        "description": "This subject is used for administrative purposes only. Students are enrolled in this subject while undertaking research towards the completion of their thesis."
    },
    {
        "subject": "Thesis (Computing Science) ",
        "link": "https://handbook.uts.edu.au/subjects/31675.html",
        "description": "This subject is used for administrative purposes only. Students are enrolled in this subject while undertaking research towards the completion of their thesis."
    },
    {
        "subject": " UNIX Systems Programming ",
        "link": "https://handbook.uts.edu.au/subjects/32547.html",
        "description": "This information technology subject provides students with professional skills and knowledge for working in a UNIX environment. UNIX is a widely popular operating system for computing platforms ranging from tablet PCs to server farms. In this subject, students learn the fundamentals of UNIX and how to perform system programming in the UNIX shell and programming language Python. These skills are essential for professional profiles as diverse as IT system administrators, system developers, data engineers, software engineers, network administrators, and IT managers at large."
    },
    {
        "subject": " Web Systems ",
        "link": "https://handbook.uts.edu.au/subjects/31268.html",
        "description": "This subject is an introduction to information technology using the web as a core case study. Students learn about the underlying hardware, software, networks and operating systems behind websites and set up a functional website using this knowledge."
    },
    {
        "subject": "Work Integrated Learning (BIT) ",
        "link": "https://handbook.uts.edu.au/subjects/41120.html",
        "description": "Students use feedback and self-reflection to enhance their knowledge and self-awareness of their roles and behaviors in a professional placement and, thereby, develop the ‘personally reflective’ graduate attribute. They engage and critically reflect on the professional placement so that they can further their understanding of specific professional organisations. This subject also gives an opportunity for the student to be able to enhance their academic skills, by doing a mini-academic, scholarly literature review on the problem context related to the student's work experience."
    },
    {
        "subject": "Work Integrated Learning 1 ",
        "link": "https://handbook.uts.edu.au/subjects/41071.html",
        "description": "This subject supports students to observe and reflect on the application of transferable skills required by and applied in the workplace by practising information technology professionals. Students develop their reflective skills through regular journal entries. Students also consider their current level of attainment of the FEIT Graduate Attributes, how they can further develop these attributes and how they can communicate their attainment of these attributes to potential employers. Because each individual student's work experience is unique and IT is a very diverse field, students are required to become active learners and take the initiative and responsibility to seek opportunities to fulfil the objectives of this experience subject. This subject provides tools and techniques to support this learning. This subject can only be undertaken while on a faculty-approved internship. See the FEIT Professional Practice Program Forum on UTSOnline for internship information and requirements."
    },
    {
        "subject": "Work Integrated Learning 2 ",
        "link": "https://handbook.uts.edu.au/subjects/41072.html",
        "description": "The IT industry is a fast-paced environment in which professionals must continually develop new skills and knowledge to stay current. This is also a requirement of Australian Computer Society membership. This subject assists students to develop their own approach to learning and professional development through the institution of a learning plan tailored to their discipline and workplace context. Students, in consultation with mentors, supervisors and teaching staff, develop a plan to meet the needs of their current workplace position as well as their future professional goals. Students demonstrate their progress by creating resources communicating a topic of their choice in IT. Finally, students reflect on the learning from their plan to develop a deeper understanding of the work they have done and the learning process. This subject can only be undertaken while on a faculty-approved internship. See the FEIT Professional Practice Program Forum on UTSOnline for internship information and requirements."
    },
    {
        "subject": "Work Integrated Learning 3 ",
        "link": "https://handbook.uts.edu.au/subjects/41073.html",
        "description": "This subject further supports students to observe and reflect on the application of transferable skills required by and applied in the workplace by practising information technology professionals. Students develop their reflective skills through regular journal entries. Students also consider their current level of attainment of the Skills for the Information Age, how they can further develop these skills and how they can communicate their attainment of these skills to potential employers. Because each individual student's work experience is different and IT is very diverse, students are required to become active learners and take the initiative and responsibility to seek opportunities to fulfill the objectives of this subject. As this is the second subject in this area that students complete, it is envisaged that less guidance is required and further extension in their work is encouraged. This subject can only be undertaken while on a faculty-approved internship. See the FEIT Professional Practice Program Forum on UTSOnline for internship information and requirements."
    },
    {
        "subject": "Work Integrated Learning 4 ",
        "link": "https://handbook.uts.edu.au/subjects/41074.html",
        "description": "The IT industry is a fast paced environment in which professionals must continually develop new skills and knowledge to stay current. This is also a requirement of Australian Computer Society membership. This subject assists students to develop their own approach to learning and professional development through the institution of a learning plan tailored to their discipline and workplace context. This subject follows on from 41073 and encourages students to further develop their planning, and self-directed learning skills. Students, in consultation with mentors, supervisors and teaching staff, develop a plan to meet the needs of their current workplace position as well as their future professional goals. Students demonstrate their progress by creating resources communicating a topic of their choice in IT. Finally, students reflect on the learning from their plan to develop a deeper understanding of the work they have done and the learning process. This subject can only be undertaken while on a faculty-approved internship. See the FEIT Professional Practice Program Forum on UTSOnline for internship information and requirements."
    },
    {
        "subject": "Work Integrated Learning Capstone ",
        "link": "https://handbook.uts.edu.au/subjects/41123.html",
        "description": "This is a project based subject intended to bring together and integrate knowledge and skills gained in the course as a whole, to apply these to an initially unstructured problem, to extend current competencies and to develop competencies that have not been sufficiently emphasised in the student's choice of subjects or practice to date. The project is expected, but not required, to be completed in the workplace while the student is on placement. The project will be planned, carried to completion and documented to a professional standard. The project is expected to provide a bridge to the student's professional future, the opportunity to demonstrate professional competencies and capabilities, to provide scope to demonstrate initiative and creativity, and to take pride in its achievement. Because each student’s work experience is different and IT is very diverse, employers or host organizations are not expected to provide formal training (although some may choose to do so). Students are required to become active learners and to seek opportunities to fulfil this subject’s objectives."
    }
]